[
  {
    "Name": "Achillea (Yarrow)",
    "Image": "/Flowers/Achillea.jpg",
    "Desc": " Achillea, commonly known as Yarrow, is a genus of  more than 100 species  of flowering plants in the  family Asteraceae , native to Europe, Asia and North America. \nThese aromatic and hardy perennials are widely known for their feathery, ferny and grey-green foliage and flattened flower clusters in variety of colors. They are popular as edging plants and in rock gardens, beds and borders. ",
    "PlantType": "Perennials",
    "Color": "Yarrow comes in a wide range of colors including white, cream, yellow, purple, orange, pink and red.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Summer",
    "Height": "This plant usually grows between 30 and 90 cm (1 to 3 ft) in height.",
    "SoilNeeds": "Achillea will grow best in well drained soil, with a pH between 5.5 and 7.0.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Aconitum (Aconite; Monkshood; Wolfsbane)",
    "Image": "/Flowers/Aconitum.jpg",
    "Desc": " Aconitum, also known as Aconite, is a genus of  more than 300 species  of flowering plants in the  family Ranunculaceae , native to cooler regions of the Northern Hemisphere. \nThese perennials are tall, upright plants that bloom in summer and autumn. The flowers are showy, hood-shaped and borne mostly in spike-like clusters. Despite its beauty, Aconitum is very poisonous so you have to be careful with it! ",
    "PlantType": "Perennials",
    "Color": "The flowers come in shades of blue, purple, white, yellow, or even pink.",
    "HardinessZones": "3-8",
    "BloomsIn": "Autumn, Summer",
    "Height": "Aconite is a tall plant that grows from 30 cm (1 ft) to 180 cm (6 ft) high, depending on species.",
    "SoilNeeds": "Aconite will perform best in rich, moist and well drained soil, with a pH level between 5.0 and 6.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Agapanthus (African Lily; Lily of the Nile)",
    "Image": "/Flowers/Agapanthus.jpg",
    "Desc": " Agapanthus is a genus composed of  about 10 species  of perennials in the  family Amaryllidaceae , native to southern Africa. \nThe plant has round clusters of showy, brightly colored, funnel-shaped flowers on its tall and slender stem. Some species have thick strap-like foliage, while others have grass-like leaves. Agapanthus is also known as the African Lily or Lily of the Nile. It’s also been called the Flower of Love. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "These flowers are usually blue, white and purple.",
    "HardinessZones": "6-11",
    "BloomsIn": "Autumn, Summer",
    "Height": "Agapanthus range in height from just 20 cm (8 inches) up to 1,8 m (6 ft) for larger varieties.",
    "SoilNeeds": "Agapanthus grows best in fertile, moist and well-drained soil. The pH of the soil is not so important. It can grow in acid, neutral, and alkaline soils.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Ageratum (Whiteweed; Flossflower)",
    "Image": "/Flowers/Ageratum.jpg",
    "Desc": " Ageratum is a genus of  about   50 species  of annual plants belonging to the  Asteraceae family , native to Central America, with a few species found in North America. \nThese plants are low-growing and have attractive flowers in lovely blue, purple, red, pink and white. The small clusters of fluffy flowers bloom in summer and fall, making it a wonderful addition to any landscape. And butterflies love them! ",
    "PlantType": "Annuals",
    "Color": "The flowers come in shades of blue, purple, red, pink and white.",
    "HardinessZones": "2-11",
    "BloomsIn": "Autumn, Summer",
    "Height": "These plants can grow up to 60 cm (2 ft) in height.",
    "SoilNeeds": "Ageratum prefers moist, but well drained soil, with pH between 5.5 and 7.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Ajuga (Bugle; Bugleweed)",
    "Image": "/Flowers/Ajuga.jpg",
    "Desc": " Ajuga is a genus of  about 70 species  in the  family Lamiaceae , native to Europe, Africa and western Asia. They are mostly perennials, but some are annuals. \nAjuga plants have shiny, rounded evergreen leaves and erect stems with small, but attractive flowers. Once established, the plant spreads quickly, making it an ideal ground cover plant for areas with part or full shade. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers are usually blue, purple and white.",
    "HardinessZones": "3-10",
    "BloomsIn": "Spring, Summer",
    "Height": "These plants can grow up to 30 cm (1 ft) tall.",
    "SoilNeeds": "The plant grows best in moist and well drained soil, with a pH between 4.0 to 6.5. However, it can handle drought and dry soils.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Alcea (Hollyhock)",
    "Image": "/Flowers/Alcea.jpg",
    "Desc": " Alcea, also known as Hollyhock, is a genus of  about 60 species  in the  family Malvaceae , native to temperate regions of Europe and Asia. The species are annuals, biennials or perennials. \nTheir strong, vertical, and upright stalks rise into the sky like a spear, carrying large, showy and brightly colored flowers. The saucer-shaped, single or double flowers are so impressive it’s hard to believe they’re actually real. It’s no wonder they can add charm and impact to any garden. ",
    "PlantType": "Annuals, Perennials",
    "Color": "Hollyhock blooms in a rainbow of colors including red, purple, pink, white, yellow and even almost black.",
    "HardinessZones": "3-9",
    "BloomsIn": "Summer",
    "Height": "Hollyhocks range in height from 60 cm (2 ft) to 3 metres (10 ft) tall.",
    "SoilNeeds": "Alcea prefers rich and well drained soil, with a pH between 6.0 and 8.0.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "hard"
  },
  {
    "Name": "Allium (Ornamental Onion)",
    "Image": "/Flowers/Allium.jpg",
    "Desc": " Allium is a genus of  more than 800 species  of bulbous perennials in the  family Amaryllidaceae , native to the Northern Hemisphere, but cultivated all over the world. \nThese plants come in a broad palette of colors, shapes and sizes. Most Alliums have globe-shaped clusters of flowers in shades of purple, pink, blue, white and yellow. The most common Alliums are edible plants, but also very useful in multiple ornamental settings. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "Most Alliums come in shades of purple, but there are pink, blue, white and yellow varieties as well.",
    "HardinessZones": "3-10",
    "BloomsIn": "Spring, Summer",
    "Height": "Alliums range in size from 15 cm (6 inches) to 180 cm (6 ft) giants.",
    "SoilNeeds": "Alliums are not fussy about their soil, so long as it is well drained.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Alstroemeria (Peruvian lily; Lily of the Incas)",
    "Image": "/Flowers/Alstroemeria.jpg",
    "Desc": " Alstroemeria, also known as Peruvian Lily, is a genus of  about   60 species  of perennials in the  family Alstroemeriaceae , native to South America. \nThis tropical beauty has long stems bearing attractive, trumpet-shaped flowers in a wide range of colors. The flower is composed of 3 petals and 3 sepals, similar in color and texture, giving the appearance of a six-petaled flower. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "The flowers come in various colors, from orange, pink, rose, purple, red to yellow and white.",
    "HardinessZones": "5-11",
    "BloomsIn": "Autumn, Summer",
    "Height": "The species range from dwarf species (20 cm or 8 inches tall) to the larger varieties that grow up to 120 cm or 4 ft in height.",
    "SoilNeeds": "The plant grows best in fertile, moist and well drained soil which is neutral or slightly acidic.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Amaryllis (Amaryllis)",
    "Image": "/Flowers/Amaryllis.jpg",
    "Desc": " Amaryllis is a genus of two species of flowering bulbs – Amaryllis belladonna and Amaryllis paradisicola. These  two species  belong to the  Amaryllidaceae family  and are native to South Africa. \nThey produce fragrant, trumpet-shaped flowers on top of tall stems. These plants are attractive to butterflies, birds and bees and lovely as cut flowers. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "The flower color is usually some shade of pink and sometimes even white.",
    "HardinessZones": "7-10",
    "BloomsIn": "Autumn, Summer",
    "Height": "Amaryllis has stem that can reach 30 - 90 cm (1-3 ft) in height and each flower is 6-11 cm (2-4 inches) in diameter.",
    "SoilNeeds": "Amaryllis grows best in well drained and slightly acidic soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Amsonia (Blue Star)",
    "Image": "/Flowers/Amsonia.jpg",
    "Desc": " Amsonia is a genus of  about 20 species  of perennials in the  family Apocynaceae , mainly native to North America. \nAmsonia has star-shaped flowers and multiple leafy stems growing from a semi-woody rootstock. The flowers are tubular at the base, with five sharply pointed petals. Amsonia can be used as a single specimen plant or in mass plantings. These plants look handsome in a perennial garden bed, as a border plant or in a cottage garden. They are also beneficial in attracting bees and hummingbirds to your garden. Not only are they easy to grow, but these plants are easy to care for as well. ",
    "PlantType": "Perennials",
    "Color": "The flowers are usually white but may be blue, pink and purple.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Summer",
    "Height": "These plants grow up to 120 cm (4 ft) tall, depending on the variety. There are also dwarf varieties that only reach 10 cm (4 inches) in height.",
    "SoilNeeds": "Amsonia prefers rich, moist and well-drained soil. The ideal soil pH is between 6.0 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Anemone (Windflower)",
    "Image": "/Flowers/Anemone.jpg",
    "Desc": " Anemone is a genus of  about   120 species  of perennial flowering plants in the  family Ranunculaceae , native to Europe, North America and Japan. \nThe flower stem bears one or several beautiful flowers, with an involucre of three leaflets below each flower, giving this plant an spectacular appearance. Whether tall-growing or low-growing, these flowers will add beauty to your garden! ",
    "PlantType": "Perennials",
    "Color": "The flowers can be found in all colors of the rainbow.",
    "HardinessZones": "4-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Anemone can grow from 10 cm to 1,5 metres (4 inches to 5 ft) tall.",
    "SoilNeeds": "The plant likes moist, but well drained soil. Anemones have a wide pH tolerance, from acid to neutral and alkaline.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Anthurium (Flamingo Flower; Laceleaf)",
    "Image": "/Flowers/Anthurium.jpg",
    "Desc": " Anthurium is a large genus of  about   1000 species  in the  family Araceae , native to the tropical regions of the Americas. \nAnthurium has large, lance-shaped or heart-shaped leaves and brightly colored, heart-shaped flower bracts. The spathe, which everyone calls a flower, is just a modified leaf. Its function is to protect the flowers. The real flowers are actually many tiny flowers growing along the spadix, arising from the base of the spathe. Anthurium is popular among flower lovers because of its bright colors, unusual appearance and lasting qualities of flowers. ",
    "PlantType": "Perennials",
    "Color": "These plants range in color from red to pink, purple, yellow, white and green.",
    "HardinessZones": "10-12",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The species can grow up to 90 cm (3 ft) in height.",
    "SoilNeeds": "Anthurium grows best in rich, well drained soil, with a pH between 5.5 and 6.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Antirrhinum (Snapdragon; Dragon Flower)",
    "Image": "/Flowers/Antirrhinum.jpg",
    "Desc": " Antirrhinum, commonly knows as Snapdragon or Dragon Flower, is a genus of  about 30 species  of flowering plants in the  family Plantaginaceae , native to Europe, northern Africa and western Asia. \nSnapdragons produce beautiful dragon-shaped, two-lipped flowers on tall spikes above the foliage. The flowers are often scented and under certain conditions release a subtle perfume. They are attractive to pollinators including bumblebees and hummingbirds. Snapdragons are popular garden plants as well as cut flowers. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers come in a range of colors including white, red, pink, orange, yellow, green and purple. Bicolor varieties are also available.",
    "HardinessZones": "5-10",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Snapdragons can grow from 20 cm (8 inches) to 120 cm (4 ft) tall, depending on species.",
    "SoilNeeds": "This plant prefers rich, moist and well drained soil. The optimal soil pH is between 5.5 and 7.0.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Aquilegia (Columbine)",
    "Image": "/Flowers/Aquilegia.jpg",
    "Desc": " Aquilegia is a genus of  about 70 species  of perennials in the  family Ranunculaceae , native to North America. \nColumbine plants have small, rounded leaves and 5 petals and 5 sepals with spurs extending from the base. Their delicate and often multi-colored flowers grow on tall, slender stalks and attract butterflies, bees and hummingbirds. ",
    "PlantType": "Perennials",
    "Color": "The flowers are yellow, white, blue, red, pink, purple or a combination of these shades.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Summer",
    "Height": "Columbine can grow up to 60 cm (2 ft) tall.",
    "SoilNeeds": "The plant grows best in moist and well drained soil, with a pH between 6.0 and 7.0. (slightly acidic to neutral). Columbine grows well in just about any type of habitat, from dry deserts to mountains.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Asclepias (Milkweed)",
    "Image": "/Flowers/Asclepias.jpg",
    "Desc": " Asclepias, also known as Milkweed, is a genus of  about   200 species  of herbaceous perennials in the  family Apocynaceae , native to Americas. \nMilkweeds produce star-shaped flowers that appear in clusters on tall woody stems. These perennials are known for their sweet-smelling flowers and milky white liquid within its foliage. They are attractive to butterflies, bees and other insects. ",
    "PlantType": "Perennials",
    "Color": "These flowers come in shades of red, purple, pink, orange, yellow and white.",
    "HardinessZones": "3-9",
    "BloomsIn": "Autumn, Summer",
    "Height": "The plant reaches heights of 30 cm (1 ft) to 180 cm (6 ft).",
    "SoilNeeds": "Asclepias thrive best in well-drained soil, with a pH range of 5.0 to 7.0.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Aster (Starwort; Frost flower)",
    "Image": "/Flowers/Aster.jpg",
    "Desc": " Aster is a genus of  about   180 species  in the  family of Asteraceae , native to Eurasia. \nAsters are popular perennial flowers, commonly seen in bouquets and gardens. The flower is actually a combination of tiny tubular flowers, grouped together in a central yellow disk and surrounded by petals, the ring of ray flowers. They resemble daisies because of their shape and yellow centers. ",
    "PlantType": "Perennials",
    "Color": "The flowers can be white, blue, purple, and red, mostly with yellow centers.",
    "HardinessZones": "3-9",
    "BloomsIn": "Autumn, Summer",
    "Height": "Asters are 60-180 cm (2-6 ft) tall.",
    "SoilNeeds": "Asters grow best in moist and well drained soil, with a pH ranging from 5.5 to 7.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Astilbe (False Goat's Beard)",
    "Image": "/Flowers/Astilbe.jpg",
    "Desc": " Astilbe is a genus of  about   20 species  of perennials in the  family Saxifragaceae , native to Asia and North America. \nAstilbe has plume-like flowers held above green, fern-like foliage on slender, upright stems. The striking clusters of small white, pink or reddish flowers bloom from spring to fall, depending on the variety. Astilbes are excellent low-maintenance plants and great cut flowers. They will also attract butterflies, bees, moths and hummingbirds to your garden! ",
    "PlantType": "Perennials",
    "Color": "The flowers are available in white, pink and red colors.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The plants range in size from 30 cm (1 ft) to 150 cm (5 ft) in height.",
    "SoilNeeds": "Astilbes thrive best in moist and well drained soil, with a pH level between 6.0 and 8.0.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Astrantia (Masterwort)",
    "Image": "/Flowers/Astrantia.jpg",
    "Desc": " Astrantia is a genus of  about 10 species  of herbaceous perennials in the  family Apiaceae , native to Europe and Asia. \nAstrantias produce long, wiry stems and compact clusters of star-like flowers with an interesting and beautiful shape. Each flower is actually a small umbel composed of numerous tiny flowers, surrounded by petal-like bracts. They bloom in spring and summer in shades of white, pink, purple and red, attracting butterflies and other garden visitors. ",
    "PlantType": "Perennials",
    "Color": "The flower colors are white, pink, purple and red.",
    "HardinessZones": "4-9",
    "BloomsIn": "Spring, Summer",
    "Height": "Astrantia can grow up to 90 cm (3 ft) in height.",
    "SoilNeeds": "These plants like fertile and moist, but well-drained soil. Most of them prefer loamy soils that retain moisture, but drain off standing water. However, some species tolerate drier soils and more sun exposure. They do not appear to be fussy about the soil pH.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Banksia (Australian Honeysuckle)",
    "Image": "/Flowers/Banksia.jpg",
    "Desc": " Banksia is a genus of  about 100 species  in the  family Proteaceae , native to the Southern Hemisphere. Most are shrubs, but some are robust trees, with diverse foliage and large, complex flower heads. \nBanksias are known for their distinctive, often large cone-shaped flower spikes. The flower head is made up of hundreds or even thousands of small individual flowers attached to a central axis. The flowers are often honey-scented and nectar-rich. There is no doubt that Banksias are valued as an important food source for a number of animals. They are highly attractive to pollinators and the birds absolutely adore them! ",
    "PlantType": "Perennials, Shrubs, Trees",
    "Color": "Banksia flowers are yellow, creamy, orange, red, green, violet or even brown.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "Banksias range from 25 cm (1 ft) to 30 metres (100 feet) in height, depending on the species.",
    "SoilNeeds": "These plants will grow in most soil types if given good drainage. However, they will perform best in sandy soils with a pH between 5.5 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Baptisia (False Indigo)",
    "Image": "/Flowers/Baptisia.jpg",
    "Desc": " Baptisia is a genus of  more than 20 species  of perennials in the  family Fabaceae , native to North America. \nThese long-living, showy plants have impressive spikes of pea-like flowers that bloom in spring and summer, attracting butterflies, hummingbirds and bees. Their durability and beauty have been long appreciated by gardeners. ",
    "PlantType": "Perennials",
    "Color": "Baptisia comes in shades of blue, yellow and white, while many hybrids can be found in a wide variety of colors.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Summer",
    "Height": "The species range in size from 30 cm to 1,5 metres (1-5 ft) in height.",
    "SoilNeeds": "Baptisia prefers rich, well drained and slightly acidic soils.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Begonia (Begonia)",
    "Image": "/Flowers/Begonia.jpg",
    "Desc": " There are  over 1500 species  of Begonias which belong to the  Begoniaceae family . They are native to Asia, Africa and Central and South America, but most of them grow in equatorial countries. \nBegonia produces single and double blooms which are showy and available in various colors, with delicate and smooth petals. These flowers are easy to grow and do well in the shade. ",
    "PlantType": "Annuals, Bulbs, Perennials",
    "Color": "Begonias come in many different colors, but mostly in red, white, yellow, orange and pink.",
    "HardinessZones": "2-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Begonias can grow from 20 - 60 cm (8 inches to 2 ft).",
    "SoilNeeds": "Begonias prefer moist, well drained and more acidic soil. They have a low tolerance for drought.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Bellis (Daisy)",
    "Image": "/Flowers/Bellis.jpg",
    "Desc": " Bellis is a genus of flowering plants, mostly perennials, that belong to the  sunflower family (Asteraceae)  and are native to Europe and northern Africa. \nThe genus contains  10 species   including Bellis perennis , the so-called “common daisy” or “English daisy”, often considered to be the iconic symbol of the whole species. Bellis members have basal leaves and solitary flower heads borne on simple stalks. They are excellent for beds, borders and rock gardens. ",
    "PlantType": "Perennials",
    "Color": "These flowers come in shades of white, red, pink and purple. They usually have white petals and a yellow center, but many cultivars are available in a range of colors.",
    "HardinessZones": "3-10",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The species are small, growing up to 20 cm (8 inches) in height.",
    "SoilNeeds": "This plant likes rich, moist and well drained soil. It is not fussy about the soil pH.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Bergenia (Elephants Ears; Winter Glow; Pigsqueak)",
    "Image": "/Flowers/Bergenia.jpg",
    "Desc": " Bergenia is a genus of  about 10 species  of flowering plants native to Central Asia. This slow growing plant belongs to the  Saxifragaceae family . \nBergenia forms clumps of large leaves and clusters of small, bell-shaped flowers. These plants are great for rock gardens, as well as for borders. ",
    "PlantType": "Perennials",
    "Color": "Bergenia comes in shades of red, pink, purple and white.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Winter, Summer",
    "Height": "Members in this genus usually grow between 20 and 60 cm (8 inches to 2 ft) tall.",
    "SoilNeeds": "Bergenia prefers moist, but well drained soil. It tolerates a wide range of soil conditions.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Borago (Borage)",
    "Image": "/Flowers/Borago.jpg",
    "Desc": " Borago, also known as Borage is a genus of  five species  in the  family Boraginaceae , native to the Mediterranean region. \nThese plants usually have long stalks, alternate leaves and attractive star-shaped or bell-shaped flowers. The nectar of the flowers is extremely attractive to bees, so expect to hear the gentle, but audible sound of bees buzzing among them when they are in bloom. They are great for beds, borders and herb gardens. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers are mostly blue in color, but can also be pink.",
    "HardinessZones": "2-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "They can grow up to 2 metres (6.5 ft) in height, depending on species.",
    "SoilNeeds": "These plants will grow in any type of soil, as long as it is rich and well drained. The ideal soil pH is between 6.0 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Bougainvillea (Bougainvillea)",
    "Image": "/Flowers/Bougainvillea.jpg",
    "Desc": " <span class=\"srTitle\">Bougainvillea is a genus of  about 15 species  of shrubs, vines and small trees in the  family Nyctaginaceae </span><span class=\"srTitle\">, native to South America. \n</span><span class=\"srTitle\">What we can see as a colorful papery “flowers” are actually modified leaves called bracts. The actual white and tiny flowers are surrounded by these large and brightly colored bracts. \n</span><span class=\"srTitle\">Bougainvillea is a popular garden plant due to its colorful bracts and its versatility in the garden. \n</span> ",
    "PlantType": "Climbers, Shrubs, Trees",
    "Color": "Bougainvillea bracts come in shades of red, purple, yellow, pink, orange and white. The flowers are generally white.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "Bougainvillea can grow from 60 cm to 12 metres (2 to 40 ft) tall.",
    "SoilNeeds": "Bougainvillea prefers moist, well drained and slightly acidic soil with a pH of 5.5 to 6.5.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Bouvardia (Firecracker bush; Trumpetellia; Hummingbird flower)",
    "Image": "/Flowers/Bouvardia.jpg",
    "Desc": " Bouvardia is a genus of  about   50 species  of flowering plants in the  family Rubiaceae , native to Mexico and tropical America. \nThese species are evergreen herbs or shrubs, with large, deep-green leaves and single or double trumpet-shaped or star-shaped flowers, carried on tall, sometimes woody stems. They attract birds and butterflies to the garden and make wonderful additions to a number of different kinds of bouquets and arrangements. ",
    "PlantType": "Herbs, Shrubs",
    "Color": "Bouvardia comes in shades of white, yellow, pink, orange and red.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The species can grow between 60 cm (2 ft) and 1,5 metres (5 ft) tall.",
    "SoilNeeds": "Bouvardia prefers well drained, sandy to clay loam soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Brugmansia (Angel's Trumpet)",
    "Image": "/Flowers/Brugmansia.jpg",
    "Desc": " Brugmansia, also known as Angel’s Trumpet, is a genus of  about 10 species  of flowering plants in the  family Solanaceae , native to tropical regions of South America. \nThe genus includes shrubs and small trees, with alternate, simple leaves and large, pendulous, trumpet-shaped flowers. The fragrant flowers come in a variety of colors, attracting moths that pollinate them. These plants contain chemicals called tropane alkaloids that in sufficient quantities could be fatal. They are beautiful, but very toxic! ",
    "PlantType": "Shrubs, Trees",
    "Color": "The flowers come in shades of white, yellow, pink, orange and red.",
    "HardinessZones": "8-11",
    "BloomsIn": "Autumn, Winter, Summer",
    "Height": "The species range in size from 90 cm (3 ft) to 8 m (26 ft) tall.",
    "SoilNeeds": "This plant likes rich, fertile, well-drained and moisture-retentive soil. It also prefers acidic soil, with a pH range of 5.5 to 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Buddleia (Butterfly Bush)",
    "Image": "/Flowers/Buddleia.jpg",
    "Desc": " Buddleia (or Buddleja) is a genus of  about   140 species  in the  family Scrophulariaceae , native to Asia, Africa and the Americas. Most of the species are deciduous or evergreen shrubs, but a few species are trees. \nBuddleia, also known as “Butterfly Bush”, produces striking flower spikes which come in a fine mixture of colors. Each flower is small, tubular and contains four petals. Buddleia is one of the most beautiful and easiest flowers to care for. These beauties are grown for their fragrant flowers which attract many different types of butterflies throughout the growing season. ",
    "PlantType": "Shrubs, Trees",
    "Color": "The flowers come in shades of purple, blue, white, pink or red.",
    "HardinessZones": "5-10",
    "BloomsIn": "Autumn, Summer",
    "Height": "The plant can grow between 30 cm (1 ft) and 5 metres (16 ft) high, depending on species.",
    "SoilNeeds": "Buddleia will grow in almost any soil, but will perform best in moist and well drained soil, with a pH level between 6.0 and 7.0.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Calendula (Marigold)",
    "Image": "/Flowers/Calendula.jpg",
    "Desc": " Calendula is a genus of  about 15 species  of herbaceous plants in the  family Asteraceae , native to Asia, Central Europe and the Mediterranean. The most popular member of the genus is Calendula officinalis, also known as Pot Marigold. \nCalendulas are admired by gardeners for their cheerful, daisy-like, bright orange and yellow flowers. Blooms may be single or double and are made of tiny disk and ray florets. The simple leaves are borne alternately along the waxy, smooth, or glandular stems. Calendulas are not only easy to grow, but also provide a long season of blooms. Once you see them bloom in your garden, you will want to see them again and again! ",
    "PlantType": "Annuals, Herbs, Perennials",
    "Color": "Calendula flowers are usually yellow and orange.",
    "HardinessZones": "2-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The plant may grow from 30 to 60 cm (1-2 ft) in height, depending on the variety and soil conditions.",
    "SoilNeeds": "This plant tolerates a wide range of soil conditions, but does best in rich, well-drained soils. The soil pH should be between 5.5 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Calluna (Heather; Common Heather; Scottish Heather)",
    "Image": "/Flowers/Calluna.jpg",
    "Desc": " Calluna, also known as Heather, is a genus in the  Ericaceae family . \n The sole species in this genus is Calluna vulgaris , an evergreen flowering shrub with hundreds of vibrant, bell shaped flowers that bloom in late summer. Calluna vulgaris is native to Europe, North Africa and temperate Asia. Although it is most often associated with the rocky highlands of Scotland where it has grown for centuries, Calluna is widely spread around the world and grows on nearly every continent. ",
    "PlantType": "Shrubs",
    "Color": "This flower comes in shades of red, purple, pink and white.",
    "HardinessZones": "4-6",
    "BloomsIn": "Summer",
    "Height": "This plant grows between 30 to 60 cm (1-2 ft) tall.",
    "SoilNeeds": "Calluna grows best in acidic, moist and well drained soil.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Camellia (Camellia)",
    "Image": "/Flowers/Camellia.jpg",
    "Desc": " Camellia is a genus of  about   250 species  of evergreen shrubs and trees in the  Theaceae family , native to eastern Asia. \nPerfectly shaped, wahy blooms come in a remarkable range of sizes, colors and forms. It is always lovely to see this long-blooming and shade-loving flower! ",
    "PlantType": "Shrubs, Trees",
    "Color": "Camellia offers a large palette of colors, from white to yellow, pink red and purple.",
    "HardinessZones": "6-10",
    "BloomsIn": "Spring, Autumn, Winter",
    "Height": "Although its a slow grower, Camellia reaches a height of 1-6 metres (3-20 ft).",
    "SoilNeeds": "These plants will perform best in moist and well drained soil, with a ph between 5.5 and 6.5.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Campanula (Bellflower)",
    "Image": "/Flowers/Campanula.jpg",
    "Desc": " Campanula is a genus of  about   500 species  of annuals, perennials and biennials in the  family Campanulaceae,  native to temperate regions of the Northern Hemisphere. \nCampanula is also known as Bellflower for its distinctive bell-like shape, and indeed, these lovely plants have flowers whose petals overlap to form a deep bell shape. These sun-loving plants come in many sizes and varieties, from dwarf alpine species to the large-growing woodland species. Many are cultivated as garden ornamentals. ",
    "PlantType": "Annuals, Perennials",
    "Color": "Depending on the species, Campanula produces white, blue, purple, pink or lilac bells.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Some species grow just 5 to 10 cm (a few inches) tall, while others can grow 2 metres (6 ft) in height.",
    "SoilNeeds": "Campanula prefers rich, well drained soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Canna (Canna Lily)",
    "Image": "/Flowers/Canna.jpg",
    "Desc": " Canna is a genus of about  10 species  of herbaceous perennials in the  family Cannaceae , native to tropical and semi-tropical regions of North, Central and South America. \nCannas are often referred to as “Canna Lily”, although they have no relationship to the lily family (Liliaceae). They produce large, banana-shaped leaves and striking, colorful flowers that resemble Irises. These exotic flowers will add color, visual interest and texture to the landscape. They will brighten up your flower beds and borders instantly all summer long. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "The flowers come in various colors, including red, orange, pink, yellow, cream and white.",
    "HardinessZones": "7-11",
    "BloomsIn": "Autumn, Summer",
    "Height": "The species vary in height from 90 cm (3 ft) to 3 m (10 ft).",
    "SoilNeeds": "They can be planted in a wide range of soils, but optimal soil is fertile, moist and well-drained. The ideal soil pH is between 5.5 and 6.5.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Celosia (Celosia)",
    "Image": "/Flowers/Celosia.jpg",
    "Desc": " Celosia is a genus of  about   50 species  in the  family Amaranthaceae , native to tropical regions of Africa, Asia and South America. \nCelosia has striking, eye-catching flowers that bloom in the summer and well into the fall. These flowers come in a variety of colors, shapes and sizes, adding color and character to your garden. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers can be purple, red, orange, pink, gold, yellow and white.",
    "HardinessZones": "2-12",
    "BloomsIn": "Autumn, Summer",
    "Height": "The plants range from dwarf species to the larger varieties that grow up to 150 cm (5 ft) high.",
    "SoilNeeds": "Celosia prefers rich, moist and well drained soil. It thrives in clay and is drought tolerant once established. The soil should have a pH level between 6.0 and 7.0.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Centaurea (Cornflower; Bachelor's Button; Basket Flower)",
    "Image": "/Flowers/Centaurea.jpg",
    "Desc": " Centaurea is a genus of  about 500 species  in the  family Asteraceae , native to the Old World. \nThese plants have erect and hairy stems, narrow, lance shaped leaves and flowers arranged in the flower heads on top of the flowering stem. The flowers contain disk florets, such as those in the yellow center of a daisy, and petal-like ray florets on the periphery of the flower head. Centaureas are rare in the wild, but are becoming increasingly popular in gardens. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers are traditionally blue in color but are also available in purple, pink, yellow and white.",
    "HardinessZones": "2-11",
    "BloomsIn": "Spring, Summer",
    "Height": "Centaurea can reach 30 to 90 cm (1 to 3 ft) in height.",
    "SoilNeeds": "Centaurea plants prefer moist and well drained soil, with a pH level between 5.5 and 7.0.  However, they are very adaptable and will grow in nutritionally poor soils.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Chrysanthemum (Mum)",
    "Image": "/Flowers/Chrysanthemum.jpg",
    "Desc": " Chrysanthemum is a genus of  about   40 species  of perennials native to Asia and Europe, which belongs to the  Asteraceae family . \nChrysanthemum is one of the most popular flowers in the world. It comes in various shapes, sizes and colors and produces wonderful flowers that bloom in summer and autumn. The plant is ideal for growing in beds and pots. ",
    "PlantType": "Perennials",
    "Color": "The flowers come in a rainbow of colors, but the most common are red, yellow, white and purple.",
    "HardinessZones": "4-11",
    "BloomsIn": "Spring, Autumn",
    "Height": "Chrysanthemums range in size from 30 cm (1 ft) to 120 cm (4 ft).",
    "SoilNeeds": "The plant likes moist and well drained soil. The optimal soil pH is between 6.0 and 7.0.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Cistus (Rock Rose)",
    "Image": "/Flowers/Cistus.jpg",
    "Desc": " Cistus, commonly known as Rock Rose, is a genus of  about 50 species  of evergreen shrubs in the  family Cistaceae , mainly native to the Mediterranean region. \nRock Roses produce simple, opposite leaves and five-petaled, bowl-shaped flowers that bloom in shades of white, pink and purple. They are considered low maintenance plants because they are drought tolerant and will hold up very well when not consistently watered. They thrive in dry conditions while providing your garden with texture and color during spring and summer months. ",
    "PlantType": "Perennials, Shrubs",
    "Color": "The flowers come in shades of purple, pink and white.",
    "HardinessZones": "7-11",
    "BloomsIn": "Spring, Summer",
    "Height": "Rock Rose can grow up to 4 m (13 ft) in height, depending on species. Cistus ladanifer, also known as Gum Cistus, can reach a height of 4 m (13 ft), but is more commonly 1 to 2 m (3 to 6 ft) tall.",
    "SoilNeeds": "Cistus will grow in almost any soil that is well-drained and will tolerate a wide pH range. The plant is drought tolerant and thrives in poor and moderately fertile soil.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Clarkia (Godetia)",
    "Image": "/Flowers/Clarkia.jpg",
    "Desc": " Clarkia is a genus of  about 40 species  of annuals in the  family Onagraceae , mostly native to western North America. \nClarkia produces cheerful, cup-shaped blooms in various shapes and colors. Flowers typically have four sepals and four petals united at the base of the flower tube. Clarkias are easy to grow beauties that will bring vivid color and charm to your summer garden. ",
    "PlantType": "Annuals",
    "Color": "These flowers come in a range of colors including red, purple, pink, orange and white.",
    "HardinessZones": "3-10",
    "BloomsIn": "Autumn, Summer",
    "Height": "This plant can reach up to 150 cm (5 ft) tall.",
    "SoilNeeds": "Clarkia grows best in rich, moist, well drained and loamy soils, with a pH between 6.0 and 8.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Claytonia (Spring Beauty)",
    "Image": "/Flowers/Claytonia.jpg",
    "Desc": " Claytonia, commonly known as Spring Beauty, is a genus of about  30 species  of flowering plants in the  family Montiaceae , native to the Americas and Asia. \nThey come in various shapes and forms, with both annual and perennial species. The flowers are usually five-petalled and come in shades of white, pink, purple and red. Their natural habitat is woodland, so they enjoy filtered sunlight. Some species are edible and taste really good! ",
    "PlantType": "Annuals, Bulbs, Perennials",
    "Color": "The flowers come in shades of white, pink, purple and red.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Winter, Summer",
    "Height": "This plant can grow up to 30 cm (1 ft) tall.",
    "SoilNeeds": "Spring Beauty prefers rich and well-drained soil. The ideal soil pH is between 5.5 and 7.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Clematis (Travellers Joy; Old Man's Beard)",
    "Image": "/Flowers/Clematis.jpg",
    "Desc": " Clematis is a genus of  more than 300 species  of flowering vines, shrubs and herbaceous perennials in the  family Ranunculaceae , native to East Asia. \nThese plants come in different shapes, sizes and colors, including a range of different flower types. They are versatile and easy to care. Clematis, also known as the “Queen of the climbers”, is without the doubt one of the most popular garden plant. The flexible and flowering stems provide exciting effects in the garden, creating a glorious experience all season long. ",
    "PlantType": "Climbers, Perennials, Shrubs",
    "Color": "These flowers offer a wide range of different colors.",
    "HardinessZones": "3-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The species range in size from 30 cm (1 ft) to 12 metres (40 ft).",
    "SoilNeeds": "Clematis prefers moist and well drained soil. The ideal soil ph is between 5.5 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Clerodendrum (Glorybower; Bagﬂower)",
    "Image": "/Flowers/Clerodendrum.jpg",
    "Desc": " Clerodendrum is a large genus of  more that 300 species  of flowering plants in the  family Lamiaceae , native to tropical and subtropical areas of the world. The genus includes shrubs, trees and climbers. \nThese plants come in various sizes, shapes and colors. They usually have large leaves and showy, brightly colored flowers that are fragrant in some species. Many species are cultivated for their colorful fruits and beautiful flowers that emerge in clusters. They make a great feature when planted in flower beds or borders. ",
    "PlantType": "Climbers, Shrubs, Trees",
    "Color": "The flowers come in various colors including red, purple, orange, pink, yellow, cream and white.",
    "HardinessZones": "7-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The plant usually grows from 90 cm (3 ft) to 12 m (40 ft) tall. Some species, such as Clerodendrum loribundum, can grow to 30 m (98 ft) in height.",
    "SoilNeeds": "Clerodendrum likes fertile, moist and well-drained soil, but is tolerant of most soil types. It is not particular as to soil pH.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Convallaria (Lily of the Valley)",
    "Image": "/Flowers/Convallaria.jpg",
    "Desc": " Convallaria is a small genus in the  family Asparagaceae , native to temperate regions of the Northern Hemisphere. The genus is composed of  three species  – Convallaria majalis, Convallaria montana and Convallaria keiskei. \nThey live in shady places and are one of the most fragrant blooming plants in the spring and early summer. The plants produce delicate bell-shaped flowers and small red berries at maturity. The dark green foliage acts as a great backdrop for the small, pendant and waxy flowers that are usually white. Each flower has six petals fused into dangling bells along one side at the top of the flower stalk. Lily of the Valley is a great plant for a woodland garden or as ground cover in shady borders. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "Convallaria blooms are usually white, but sometimes pink.",
    "HardinessZones": "2-9",
    "BloomsIn": "Spring, Summer",
    "Height": "Convallaria reaches about 30 cm (1 ft) in height.",
    "SoilNeeds": "Convallaria will grow best in rich, moist and well drained soil. The plant is not fussy about the soil pH.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Coreopsis (Tickseed; Calliopsis)",
    "Image": "/Flowers/Coreopsis.jpg",
    "Desc": " Coreopsis is a genus of  about 100 species  in the  family Asteraceae , commonly found in prairies and woodlands of North, Central and South America. \nCoreopsis produces vibrant, bright colored and daisy-like flowers that bloom in summer and fall. As they grow, the plants develop individual flowers or flowers arranged in terminal clusters. They are easy to maintain and are ideal for beds, borders, containers and groundcovers. Plant them in masses for a great looking effect! ",
    "PlantType": "Annuals, Perennials",
    "Color": "Although usually yellow in color, these flowers come in different colors including red, orange, pink, maroon,  lavender. Bi-colored flowers are also possible.",
    "HardinessZones": "3-10",
    "BloomsIn": "Autumn, Summer",
    "Height": "The different varieties of this plant range in height from 15 cm (6 inches) to 120 cm (4 ft).",
    "SoilNeeds": "Coreopsis will thrive in almost any type of soil that is well drained.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Cosmos (Cosmos)",
    "Image": "/Flowers/Cosmos.jpg",
    "Desc": " Cosmos is a genus of  about 40 species  of flowering plants, mostly annuals. They belong to the  Asteraceae family , one of the largest family of flowering plants. \nThese attractive plants, originated in tropical America, have big and bright daisy-like flowers and green leaves that grow in various shapes and patterns. If you are looking for a pretty and useful flower that attracts bees, birds and butterflies and require low maintenance, Cosmos is a perfect flower for you! ",
    "PlantType": "Annuals",
    "Color": "These flowers come in amazing variety of bright colors, from pink, orange and scarlet to yellow and white.",
    "HardinessZones": "2-11",
    "BloomsIn": "Autumn, Summer",
    "Height": "Cosmos can grow between 30-120 cm (1-4 ft) tall.",
    "SoilNeeds": "Cosmos likes moist and well drained soil, with a pH between 5.0 and 8.0.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Crocosmia (Montbretia)",
    "Image": "/Flowers/Crocosmia.jpg",
    "Desc": " Crocosmia is a genus of  about 10 species  in the  family Iridaceae , native to southern and eastern Africa. \nThe plant has sword-shaped foliage and showy, brightly-colored, funnel-shaped flowers on arching stems. Crocosmia will bloom from July to October and attract much attention. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "These flowers are usually in shades of red and orange, but can also be yellow.",
    "HardinessZones": "5-10",
    "BloomsIn": "Autumn, Summer",
    "Height": "The plant can grow up to 60 cm (2 ft) tall.",
    "SoilNeeds": "Crocosmia likes fertile, moist and well drained soil of any pH. However, it will grow in a wide range of conditions.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Crocus (Crocus)",
    "Image": "/Flowers/Crocus.jpg",
    "Desc": " Crocus is a genus of  about 90 species  of perennials in the  Iridaceae family , native to Asia, North Africa, Mediterranean Europe and Alps. \nMajority of species are abundant in the wild, from rocky mountains and alpine meadows to woodlands and scrublands. The flowers are cup-shaped and mainly composed of six petals. They come in a variety of colors and are often the first to bloom in late winter or early spring. The true arrival of spring is frequently marked by the bright colors of the Crocus. ",
    "PlantType": "Bulbs",
    "Color": "These flowers are white, cream, yellow, blue and purple, and there are even striped varieties.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Autumn, Winter",
    "Height": "Crocus can reach between 20 cm (8 inches) and 30 cm (12 inches) in height.",
    "SoilNeeds": "Although Crocus is tolerant of a wide range of soils, it will grow best in a well drained soil, with a pH between 6.0 and 8.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Cyclamen (Sowbread)",
    "Image": "/Flowers/Cyclamen.jpg",
    "Desc": " Cyclamen is a genus of  about 20 species  of tuberous perennials in the  family Primulaceae . Most of them are native to Europe, Mediterranean. \nThese plants have attractive heart-shaped leaves and uniquely shaped, colorful, five-petaled flowers. They are one of the most popular house plants, but in right conditions they will also flourish outdoors. They will fascinate you with their beauty and perfection! ",
    "PlantType": "Bulbs, Perennials",
    "Color": "The flowers are usually white, red, rose, purple or pink.",
    "HardinessZones": "4-9",
    "BloomsIn": "Autumn, Winter",
    "Height": "Cyclamens are relatively small plants growing up to 15 cm (6 inches) in height.",
    "SoilNeeds": "These plants prefer organically rich and well drained soil. Grow them in moist, but not waterlogged soil.",
    "SunNeeds": "Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Cymbidium (Cymbidium)",
    "Image": "/Flowers/Cymbidium.jpg",
    "Desc": " Cymbidium is a genus of  about 50 species  in the  family Orchidaceae , native to high altitudes in Southeast Asia, though several species are native to northern Australia. \nCymbidium have a long stem that produces beautiful, exotic, waxy-looking flowers. These perennials grow on rocks or tree branches in nature. They are one of the most popular orchids in the world because of their easy maintenance, adaptability and spectacular flowers in a wide range of colors. ",
    "PlantType": "Perennials",
    "Color": "Cymbidium comes in various colors such as white, green, yellow, brown, orange, pink and red.",
    "HardinessZones": "5-10",
    "BloomsIn": "Spring, Autumn, Winter",
    "Height": "Cymbidium range in size, from dwarf species to some reaching 1,5 metres (5 ft) in height.",
    "SoilNeeds": "This plant can grow in almost any kind of soil that is well drained.",
    "SunNeeds": "Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Dahlia (Dahlia)",
    "Image": "/Flowers/Dahlia.jpg",
    "Desc": " Dahlia is a genus of tuberous-rooted herbs in the  family of Asteraceae , native to Central America and South America. \nThere are  42 species  of this perennial plant and each of them come in different colors, sizes and shapes. Dahlia is considered as one of the most popular garden flowers because of its toothed, green leaves<b> </b>and attractive colorful flowers. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "Dahlias bloom in all colors, except blue.",
    "HardinessZones": "3-11",
    "BloomsIn": "Autumn, Summer",
    "Height": "The species vary in height, from the 40 cm (1 ft) right up to 2 metres (7 ft).",
    "SoilNeeds": "Dahlia performs best in rich, moist and well drained soil that is slightly acidic.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Datura (Devil's Trumpet)",
    "Image": "/Flowers/Datura.jpg",
    "Desc": " Datura is a genus of  about 10 species  of flowering plants in the  family Solanaceae , which are mainly native to North America. \nDaturas can grow to 2 m (7 ft) in height, with leaves ranging from small to large and gray-green to dark green. They are either annuals or short-lived perennials, characterized by showy, erect, trumpet-shaped flowers. The flowers are usually white, but sometimes yellow, pinkish and purple. They first grow upright, and later incline downwards, emitting an intense fragrance which is strongly attractive to insects such as moths. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers are usually white, but may be yellow, pink and purple.",
    "HardinessZones": "5-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "These plants can reach up to 2 m (7 ft) in height.",
    "SoilNeeds": "Datura prefers rich, moist and well-drained soil. The ideal soil ph is between 6.0 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Delosperma (Ice Plant)",
    "Image": "/Flowers/Delosperma.jpg",
    "Desc": " Delosperma, also known as Ice Plant, is a genus of  about 150 species  in the  family Aizoaceae , native to southern and eastern Africa. \nDelosperma is a small succulent that blooms from late spring into fall. It produces attractive foliage and colorful, daisy-like flowers. These ground covers are excellent for rock gardens and containers. ",
    "PlantType": "Cactus - Succulents, Perennials",
    "Color": "Delosperma comes in many colors including red, purple, orange, pink, yellow and white.",
    "HardinessZones": "5-10",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The plant grows up to 15 cm (6 inches) in height.",
    "SoilNeeds": "Delosperma likes dry, sandy and poor soils with good drainage. It prefers soils with a pH level between 6.0 and 8.0.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Delphinium (Larkspur)",
    "Image": "/Flowers/Delphinium.jpg",
    "Desc": " Delphinium, commonly known as Larkspur, is a genus of  about 300 species  in the  family Ranunculaceae , native to Northern Hemisphere, with a few species found in Africa. \nDelphiniums are widely known for their showy spikes, strong stems and beautiful blue flowers. ",
    "PlantType": "Perennials",
    "Color": "Delphiniums come in several colors, including blue, red, pink, white, violet, and yellow, but blue is the most common.",
    "HardinessZones": "3-7",
    "BloomsIn": "Autumn, Summer",
    "Height": "The flower spikes can reach 30 cm to 180 cm (1 to 6 ft) tall.",
    "SoilNeeds": "The plant grows best in moist, but well drained soil. The pH of the soil should be neutral to slightly alkaline.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Deutzia (Deutzia)",
    "Image": "/Flowers/Deutzia.jpg",
    "Desc": " Deutzia is a genus of about  60 species  of flowering shrubs in the  family Hydrangeaceae , native to Asia and Central America. \nThese shrubs have long, arching branches and 5-petalled, cup-shaped or star-shaped flowers that bloom in spring and summer. The flowers are often fragrant and carried in clusters, usually rising above the arching shoots. ",
    "PlantType": "Shrubs",
    "Color": "Most species are white, but some are pink or red.",
    "HardinessZones": "4-8",
    "BloomsIn": "Spring, Summer",
    "Height": "The species range in height from 30 cm (1 ft) to 4 metres (13 ft).",
    "SoilNeeds": "Deutzia prefers moist and well drained soil. The plant can grow in a wide range of pH conditions.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Dianthus (Carnation; Pink; Sweet William)",
    "Image": "/Flowers/Dianthus.jpg",
    "Desc": " Dianthus, also known as Carnation, is a genus of the  Caryophyllaceae family  mostly native to Europe and Asia. It contains  about 300 species  of annuals, perennials and subshrubs. \nMost species have simple, narrow leaves and abundant flowers that come in many shapes and colors. Carnations are often spicily fragrant and long blooming, making them perfect for bouquets and gardens. They are valued for their beauty, charm, clove-like scent and long-lasting freshness. ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "The flowers come in shades of red, pink, purple and white or combinations of these colours. Cultivated species are available in a wider range of colors.",
    "HardinessZones": "5-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Their height range from just 10 cm to 90 cm (4 inches to 3 ft).",
    "SoilNeeds": "Carnation prefers rich and well drained soil. The ideal soil pH is somewhere between 6.0 and 7.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Diascia (Twinspur)",
    "Image": "/Flowers/Diascia.jpg",
    "Desc": " Diascia is a genus of  about 70 species  in the  family Scrophulariaceae , native to southern Africa. \nDiascia produces small, dark green leaves and small, but profuse flowers. The colorful, shell-like flowers are borne in loose clusters from spring to autumn. They are tubular and lipped, each with two spurs on the rear of the flower. Diascia is an extremely popular ornamental plant worldwide. It is great for rockeries, containers, and borders. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers come in shades of pink, purple, orange, and white, each with a contrasting yellow throat.",
    "HardinessZones": "7-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The plant grows between 30 cm (1 ft) and 60 cm (2 ft) in height.",
    "SoilNeeds": "Diascia grows best in soil that is fertile, moist, well drained and slightly acidic, with a pH range of 5.5 to 6.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Dicentra (Bleeding Heart)",
    "Image": "/Flowers/Dicentra.jpg",
    "Desc": " Dicentra, commonly known as “Bleeding Heart”, is a genus of  about 10 species  of herbaceous plants in the  family Papaveraceae , native to Asia and North America. \nTheir outstanding characteristic is the shape of the flowers. Dicentra bears heart-shaped flowers hanging down in a row from arching stems, from which a little “drop of blood” dangles at the bottom, giving the plant a spectacular appearance. They bloom in spring and early summer and dies back to the ground as the heat of summer arrives. ",
    "PlantType": "Perennials",
    "Color": "The flowers are usually red, pink and white.",
    "HardinessZones": "2-9",
    "BloomsIn": "Spring, Summer",
    "Height": "Dicentra can reach up to 90 cm (3 ft) in height.",
    "SoilNeeds": "Dicentra prefers moist, but well drained soil. The soil should be organic and slightly acidic.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Dietes (Dietes)",
    "Image": "/Flowers/Dietes.jpg",
    "Desc": " Dietes is a genus of  6 species  of rhizomatous plants in the  family Iridaceae , native to southern and central Africa, with the exception of one species, the Dietes robinsoniana, which is endemic to Lord Howe Island off the coast of Australia. \nDietes produces narrow, sword-like foliage and large iris-like flowers on tall wiry stems. It is a versatile plant that can be used for borders, water gardens and mass plantings. ",
    "PlantType": "Perennials",
    "Color": "The flowers are white to creamy yellow in color, with brown, yellow and purple markings on the tepals.",
    "HardinessZones": "8-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "This plant grows up to 150 cm (5 ft) tall.",
    "SoilNeeds": "They are not fussy about soil type, but will perform best in rich, moist and well drained soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Digitalis (Foxglove)",
    "Image": "/Flowers/Digitalis.jpg",
    "Desc": " Digitalis, commonly known as Foxglove, is a genus of  about 25 species  of herbaceous plants in the  family Plantaginaceae , native to Europe, Asia and northwestern Africa. \nThis eye-catching, dramatic plant bears cluster of tall, pendulous tubular or bell-shaped flowers. Attractive and distinct, Foxgloves are easily recognizable wild flowers widely known for their toxicity, as well as medical properties. ",
    "PlantType": "Perennials",
    "Color": "These flowers appear in shades of white, yellow, pink, red and purple.",
    "HardinessZones": "4-9",
    "BloomsIn": "Spring, Summer",
    "Height": "Foxgloves are tall beauties which can grow up to 180 cm (6 ft), depending on variety.",
    "SoilNeeds": "The plant grows best in moist and well drained soil, with a pH between 6 and 7.5.",
    "SunNeeds": "Full sun, Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Dracula (Monkey Orchid)",
    "Image": "/Flowers/Dracula.jpg",
    "Desc": " Dracula is a genus of  more than 100 species  of flowering plants in the  family Orchidaceae , native to Central America and part of South America. \nThe species in this genus are quite diverse, but the most popular are those which resemble monkeys. These unusual, showy flowers are one of the most amazing orchids you’ve ever seen. Mother Nature is so creative! ",
    "PlantType": "Perennials",
    "Color": "These flowers come in various colors, such as red, purple, lavender, yellow and white. They range from nearly black to white.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The plant can grow up to 60 cm (2 ft) tall.",
    "SoilNeeds": "Dracula requires moist, well-drained soil and high humidity. The recommended soil pH is 5.5 to 7.0, depending on species.",
    "SunNeeds": "Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Dryas (Mountain Avens; Holtasoley)",
    "Image": "/Flowers/Dryas.jpg",
    "Desc": " Dryas is a small genus of  6 species  of flowering plants in the  family Rosaceae , with the common name Mountain Avens. \nThe species are native to the alpine and arctic areas of Europe, North America and Asia. However, these ground-hugging perennials will grow almost anywhere and can be found as far north as there is land! This charming little plant has saucer-shaped flowers with eight to ten petals on naked stalks. Dryas is ideal for rock gardens or for planting in cracks between paving or walls. ",
    "PlantType": "Perennials, Shrubs",
    "Color": "These flowers are usually white or cream, with yellow centre.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Summer",
    "Height": "Dryas is a small plant, growing only 20 cm (8 inches) in height.",
    "SoilNeeds": "The plant can grow in many different soil types and pH levels, but requires good drainage.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Echeveria (Hen and Chicks)",
    "Image": "/Flowers/Echeveria.jpg",
    "Desc": "<p align=\"justify\" style=\"text-align: left;\">Echeveria is a genus of succulents in the  Crassulaceae family , native to Central America. It includes  over a hundred species  of succulent plants. \nEcheveria is popular mostly because of its attractive rosettes of fleshy, brightly colored leaves. When it blooms it produces beautiful, bell-shaped flowers on a tall arching stalk. ",
    "PlantType": "Cactus - Succulents",
    "Color": "Echeveria has beautiful leaves and stunning flowers in a large variety of colors.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The species can grow from 10 cm to 60 cm (4 inches to 2 ft) high.",
    "SoilNeeds": "Echeverias grow best in well drained soil, with a slightly acidic pH.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Echinacea (Coneflower)",
    "Image": "/Flowers/Echinacea.jpg",
    "Desc": " Echinacea is a genus of  about 10 species  in the  family Asteraceae , native to North America. \nEchinacea, commonly called Coneflower, has attractive and colorful daisy-like flowers, with cone-shaped central disc surrounded by a ring of petal-like rays. It has lance-shaped or oval-shaped dark green leaves and tall, slender, hairy stem that can reach up to 120 cm (4 ft) in height. These perennials are easy to maintain once you know the secrets to meeting their needs. They are heat and drought tolerant and will attract birds and pollinators in your garden. ",
    "PlantType": "Perennials",
    "Color": "These flowers come in shades of white, yellow, orange, pink, purple, red and brown, depending on variety. The most common are the purple ones.",
    "HardinessZones": "3-10",
    "BloomsIn": "Summer",
    "Height": "Coneflowers will grow between 30 cm (1 ft) and 120 cm (4 ft) tall.",
    "SoilNeeds": "Echinacea likes medium moisture and well drained soil, with a pH between 6.0 and 7.0. In the wild, they usually grow in poor and rocky soil and can tolerate more alkaline conditions.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Echinops (Globe Thistle)",
    "Image": "/Flowers/Echinops.jpg",
    "Desc": " Echinops is a genus that contains  about 150 species  of flowering plants native to Europe, Asia and northern Africa. The genus belongs to the  Asteraceae family , one of the largest plant families. \nEchinops are well known and recognizable for their globular crown of deep blue flowers and spiny, woolly foliage that is often gray-green. It is useful ground-cover plant, an excellent cut flower and a good choice for the border, capable of attracting any pollinators around. ",
    "PlantType": "Perennials",
    "Color": "The flowers are mostly blue, but you can also find them in white, purple and blue-grey. Their long stems are gray-green in color.",
    "HardinessZones": "3-9",
    "BloomsIn": "Summer",
    "Height": "The plant can grow from 50 cm to 1,5 metres (2 to 5 ft) in height.",
    "SoilNeeds": "Echinops grows best in well drained soil and prefers a pH between 5.5 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Emilia (Tassel Flower)",
    "Image": "/Flowers/Emilia.jpg",
    "Desc": " Emilia, also known as Tassel Flower, is a genus of  more than 100 species  in the  family Asteraceae , distributed mainly in tropical regions of the Old World. \nEmilia has bright, tassel-like flowers appearing on its slender stems in summer and early fall. The flowers come in shades of purple, red and orange and are great for container gardens and fresh cut flower arrangements. ",
    "PlantType": "Annuals",
    "Color": "The flowers come in shades of purple, red and orange.",
    "HardinessZones": "3-10",
    "BloomsIn": "Autumn, Summer",
    "Height": "These plants usually grow from 30 cm (1 ft) to 60 cm (2 ft), and possibly up to 90 cm (3 ft) tall, depending on species.",
    "SoilNeeds": "The plant is not fussy about soil pH, but the soil must be well drained.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Epimedium (Barrenwort; Bishop's hat; Horny Goat Weed)",
    "Image": "/Flowers/Epimedium.jpg",
    "Desc": " Epimedium is a genus of  about 60 species  in the  family Berberidaceae , native to Europe and Asia and distributed in areas around the Mediterranean Sea and Eastern Asia. \nThese shade-loving plants have charming, heart-shaped or arrowhead-shaped leaves and beautiful star-shaped flowers in various colors. Epimediums are long-lived perennials and good ground covers known for their toughness, strength and ability to compete with tree roots, which makes them a great choice for any shade garden. ",
    "PlantType": "Perennials",
    "Color": "These flowers come in many stunning colors, including white, red, pink, purple, yellow and orange, as well as bi-colored varieties.",
    "HardinessZones": "4-9",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The plant can grow up to 60 cm (2 ft) in height.",
    "SoilNeeds": "Epimedium prefers rich and moist soil, with a pH between 5.5 to 7.0. However, it will adapt to a wide range of conditions and survive in nearly any shady location.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Epiphyllum (Orchid Cactus)",
    "Image": "/Flowers/Epiphyllum.jpg",
    "Desc": " Epiphyllum is a genus of  about 15 species  of epiphytic plants in the  family Cactaceae , native to tropical and subtropical America. \nThe flowers are impressive in size, color and fragrance. Like all cacti, Epiphyllums have stems, but no leaves. They are often grown in hanging baskets to accommodate their leaf-like stems, but can also be grown in containers. In the wild, Epiphyllum grows between tree branches and into rock crevices. The genus includes one of the most expensive flowers in the world – Epiphyllum oxypetalum, also known as Kadupul or Queen of the Night. ",
    "PlantType": "Cactus - Succulents",
    "Color": "The flowers are usually white, sometimes with yellow or pink sepals. However, most Epiphyllums grown today are hybrids and may be red, purple, pink, orange and yellow.",
    "HardinessZones": "10-12",
    "BloomsIn": "Spring, Summer",
    "Height": "Epiphyllum can reach 10 m (30 ft) in height.",
    "SoilNeeds": "Epiphyllum prefers rich and well drained soil. For majority of plants, the ideal soil pH is slightly acidic with a pH range of 5.5 to 6.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Eranthis (Winter Aconite)",
    "Image": "/Flowers/Eranthis.jpg",
    "Desc": " Eranthis is a genus of  about 10 species  of tuberous perennials in the  family Ranunculaceae , native to southern Europe and Asia. \nThese low-growing plants are among the most striking winter flowers and one of the earliest bulbs to bloom in spring, often appearing alongside Snowdrops. The cup-shaped flowers are yellow or white, distinct and quite unusual, supported by divided leafy bracts. They are easy to maintain and can survive snow and frost. These early-bloomers are great for beds and borders, and will look beautiful planted in large drifts under trees. They are suitable for rock gardens, cottage gardens and as a groundcover. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "The flowers are yellow in most species, with some species being white flowered.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Winter",
    "Height": "These low growing plants can reach a maximum height of 20 cm (8 inches), but usually they are much smaller.",
    "SoilNeeds": "The plant is adaptable to a wide variety of soils, as long as they are well drained. It tolerates most types of soils including loam, clay, chalk and sand.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Eremurus (Foxtail Lily; Desert Candle)",
    "Image": "/Flowers/Eremurus.jpg",
    "Desc": " Eremurus, commonly known as Foxtail Lily, is a genus of  about 50 species  of deciduous perennials in the  family Asphodelaceae , native to Europe and temperate Asia. \nFoxtail Lilies bloom from spring to midsummer, producing dense clusters of small star-shaped flowers on tall, erect stems. Their spectacular, rich, tall and slender clusters make them one of the most attractive bulbous plants that will add height and interest to the borders. ",
    "PlantType": "Perennials",
    "Color": "Flower clusters are covered with orange, pink, yellow and white blossoms.",
    "HardinessZones": "5-9",
    "BloomsIn": "Spring, Summer",
    "Height": "Foxtail Lilies are tall plants that reach 2,5 metres (8ft) or less in height, depending on the species.",
    "SoilNeeds": "Eremurus prefers well drained soil that is acid, alkaline or neutral.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Eryngium (Sea Holly)",
    "Image": "/Flowers/Eryngium.jpg",
    "Desc": " Eryngium, also known as Sea Holly, is a genus of  about 250 species  in the  family Apiaceae , mostly native to Europe and the Mediterranean. Most species are perennials, but some are annuals. \nThe Sea Holly produces showy and attractive thistle-like flower heads surrounded by spiny silvery-blue bracts on strong stems. These sun loving plants will bloom in summer and attract butterflies and bees to your garden. ",
    "PlantType": "Annuals, Perennials",
    "Color": "Eryngiums are usually blue, purple, green or whitish.",
    "HardinessZones": "3-9",
    "BloomsIn": "Autumn, Summer",
    "Height": "They can range from 30 cm (1 ft) to 150 cm (5 ft) tall, depending on the species.",
    "SoilNeeds": "These plants need good drainage and plenty of sun. They are not particular about soil pH and will tolerate poor and sandy soils. The plant has a long taproot, which makes it drought tolerant.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Erysimum (Wallflower)",
    "Image": "/Flowers/Erysimum.jpg",
    "Desc": " Erysimum is a genus of  about 180 species  of flowering plants in the  family Brassicaceae , native to Europe, western Asia and North America. \nErysimum produces narrow, grey-green leaves and four-petalled, brightly colored and often fragrant blooms borne on long spikes. They make an excellent choice for your garden, flower bed or garden border. ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "These flowers are usually yellow, but may also be red, orange and mauve.",
    "HardinessZones": "6-10",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Erysimum can grow up to 90 cm (3 ft) high.",
    "SoilNeeds": "Erysimum prefers well drained soil, with a pH between 5.0 and 8.0.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Erythronium (Fawn Lily)",
    "Image": "/Flowers/Erythronium.jpg",
    "Desc": " Erythronium is a genus of  about 30 species  of bulbous perennials in the  family Liliaceae . Most of the species are native to North America, except Erythronium dens-canis which is native to Central and Southern Europe. \nMembers of this genus have attractive, pendent flowers and mottled leaves, often with bizarre colors or patterns. They are easy to grow and popular in gardens. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "The flowers come in shades of yellow, purple, pink, red and white.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring",
    "Height": "Erythronium can grow up to 60 cm (2 ft) in height.",
    "SoilNeeds": "Erythronium grows best in moist and well drained soil. It is not fussy about soil pH, but is intolerant of dry conditions.",
    "SunNeeds": "Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Eschscholzia (Golden Poppy)",
    "Image": "/Flowers/Eschscholzia.jpg",
    "Desc": " Eschscholzia is a genus of  12 species  of annuals and perennials in the  family Papaveraceae , native to the United States and Mexico. \nMost species have basal leaves and funnel shaped flowers consisted of four yellow or orange petals that grow at the end of the stem. They are beautiful, drought-tolerant and easy to maintain. ",
    "PlantType": "Annuals, Perennials",
    "Color": "Their color ranges from yellow to orange.",
    "HardinessZones": "6-10",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The plants grow up to 30 cm (1 ft) tall, but some species have been known to grow taller.",
    "SoilNeeds": "In general, these plants grow in a range of soils, but prefer loamy or clay soils. They thrive in well-drained, poor soils with relatively little organic matter, preferring neutral to slightly alkaline soils.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Euphorbia (Spurge)",
    "Image": "/Flowers/Euphorbia.jpg",
    "Desc": " Euphorbia, commonly known as Spurge, is a huge genus of  more than 2000 species  in the  family Euphorbiaceae , native to all continents except Antarctica. \nThe genus is very diverse and includes species with very different characteristics. It contains annual and perennial herbs, as well as shrubs and trees species that can reach 20 meters in height, many of which are succulents and very drought tolerant. Spurges are popular for their unique floral structures – handsome, richly colored leaves and unusual flowers aggregated into an inflorescence or cluster of flowers known as a “cyathium”. ",
    "PlantType": "Annuals, Cactus - Succulents, Perennials, Shrubs, Trees",
    "Color": "The bracts come in almost every color imaginable. The real flowers are tiny and usually yellow in color.",
    "HardinessZones": "4-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The species range in size from 30 cm to 20 metres (1 ft to 66 ft) tall.",
    "SoilNeeds": "Euphorbia prefers well drained soil. Even though they are not particular about soil pH, they grow easiest with a soil pH from 6.0 to 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Eustoma (Lisianthus; Prairie Gentian)",
    "Image": "/Flowers/Eustoma.jpg",
    "Desc": " Eustoma is a genus of only  three species  in the  Gentianaceae family , native to southern United States, Mexico, Caribbean and South America. \nEustoma, also known as Lisianthus or Prairie Gentian, can be annual or perennial, depending on where the plant is grown. The plant has large, beautiful and showy bell-shaped flowers in single or double-petal varieties. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers come in white, cream, blue, purple, pink and lilac.",
    "HardinessZones": "8-11",
    "BloomsIn": "Autumn, Summer",
    "Height": "Depending on the variety, Eustoma will grow from 15 cm (6 inches) to 80 cm (3 ft) in height.",
    "SoilNeeds": "The plant performs best in rich, moist and well drained soil, with a pH between 6.5 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Felicia (Blue Daisy; Marguerite Daisy)",
    "Image": "/Flowers/Felicia.jpg",
    "Desc": " Felicia is a genus of  about 80 species  of annuals, perennials and small shrubs in the  Asteraceae family . Most of them are native to southern Africa, where it can be found growing on the coastal dunes, rocky and sandy plains, gravelly slopes and basalt cliffs. \nThe plant has typical “daisy” flower heads, usually with showy, blue, white or purple petals and bright yellow centers. This eye-catching beauty has a long flowering season from spring to autumn. It attracts butterflies, bees, wasps, spiders and thrips. ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "The flowers are blue, white, lilac or purple. Most of them have yellow centers, with the exception of the Felicia heterophylla which is all-blue in color.",
    "HardinessZones": "8-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The species can grow up to 50 cm (20 inches) in height.",
    "SoilNeeds": "Felicia grows in almost any well drained soil.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Forsythia (Golden Bell)",
    "Image": "/Flowers/Forsythia.jpg",
    "Desc": " Forsythia is a genus of  about 10 species  of flowering plants in the  family Oleaceae , native to East Asia. \nThese plants are long-lived, but fast growing deciduous shrubs. They produce clusters of bright yellow flowers which usually come before the leaves, adding a dramatic effect in early spring. When it rains, the flowers turn into a pendant shape and protect their reproductive parts. ",
    "PlantType": "Shrubs",
    "Color": "The flowers are yellow in color.",
    "HardinessZones": "4-9",
    "BloomsIn": "Spring",
    "Height": "Forsythia grows between 60 cm (2 ft) and 6 metres (20 ft) tall, depending on species.",
    "SoilNeeds": "The soil should be moist, but well drained and rich in organic matter. Forsythia grows in low-acidic, neutral and even moderately alkaline soils.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Freesia (Freesias)",
    "Image": "/Flowers/Freesia.jpg",
    "Desc": " Freesia is a genus which contains  approximately 20 species  of herbaceous perennial plants in the  family Iridaceae , native to Africa. \nTheir fragrant and bell-shaped blooms appear on one side of a 30 – 40 cm (1 ft) stem, called a scape. Because of their fragrance, Freesias are one of the most popular flowers in the world and usually grown for use as cut flowers. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "Freesia comes in white, yellow, orange, red, pink, mauve, lavender and purple colors.",
    "HardinessZones": "9-10",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Freesia can grow up to 40 cm (1 ft) tall.",
    "SoilNeeds": "This plant likes moist and well drained soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Fritillaria (Checkered Lily; Snakes Head; Crown Imperial)",
    "Image": "/Flowers/Fritillaria.jpg",
    "Desc": " Fritillaria is a genus of  more than 100 species  of herbaceous bulbous plants in the  Liliaceae family , native to the northern hemisphere. \nTall and wiry stem bears a circle of pendant, colorful and showy bell-shaped flowers. It is an eye-catching, elegant plant that reaches a height of 1,5 metres. Fritillaria is useful in beds, borders, containers, rock gardens and also as a cut flower. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "Fritillaria comes in variety of colors, from bright yellow to orange, green and deep red.",
    "HardinessZones": "4-8",
    "BloomsIn": "Spring",
    "Height": "Fritillaria can reach 30 cm to 1,5 metres (1-5 ft) in height, depending on variety.",
    "SoilNeeds": "The plant requires well drained soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Fuchsia (Lady's eardrop)",
    "Image": "/Flowers/Fuchsia.jpg",
    "Desc": " Fuchsia is a genus of  more than 100 species  of deciduous or evergreen shrubs or small trees in the  family Onagraceae , native to Central America and South America. \nFuchsia is greatly appreciated for its highly ornamental, attractive and usually pendant flowers in combinations of red, white, pink and purple. Today, fuchsia is one of the most cultivated ornamental plants in the world. ",
    "PlantType": "Shrubs, Trees",
    "Color": "Fuchsia develops white, yellow, orange, red and purple colored flowers, composed of red sepals and purple petals.",
    "HardinessZones": "6-11",
    "BloomsIn": "Autumn, Summer",
    "Height": "Fuchsia can grow from 15 cm (6 inches) to 15 metres (50 ft) in height, depending on species.",
    "SoilNeeds": "Fuchsia prefers moist, but well drained soil, with a pH between 5.5 and 6.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Gaillardia (Blanket Flower)",
    "Image": "/Flowers/Gaillardia.jpg",
    "Desc": " Gaillardia is a genus of  about 25 species  of mostly perennials in the  family Asteraceae , native to Americas. \nGaillardia produces beautiful richly colored, daisy-like flowers. Each flower is composed of central disk florets surrounded by the colorful and much showier ray florets. The ray florets are usually flat, but tubular and trumpet shapes are also available. Gaillardias are valuable for their very long season of bloom. They are drought tolerant and easy to maintain. These sun-loving flowers will bloom continuously throughout the summer and fall and will add color and cheer to your garden! ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers come in various shades of red, orange, yellow, purple and brown. The bicolor blooms are pretty intense.",
    "HardinessZones": "2-10",
    "BloomsIn": "Autumn, Summer",
    "Height": "Plants belonging to the Gaillardia genus range in height from 15 cm (6 inches) to 90 cm (3 ft).",
    "SoilNeeds": "These plants grow best in moist and well drained soil, with a pH between 5.5 and 7.0. However, they will tolerate drought, heat, poor and sandy soils, but heavy clay soil will probably kill them.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Galanthus (Snowdrops)",
    "Image": "/Flowers/Galanthus.jpg",
    "Desc": " Galanthus, commonly known as Snowdrop, is a genus of  about 20 species  of bulbous plants in the  family Amaryllidaceae , native to Europe and the Middle East. \nThese early spring emblems are one of the first bulbs to bloom in spring. Snowdrops are famous for their white, bell-shaped flowers which hang down loosely, giving the impression of modesty. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "Unlike many other flowers, Galanthus only comes in one color - creamy white.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Winter",
    "Height": "These tiny flowers grow up to 25 cm (10 inches) high.",
    "SoilNeeds": "Galanthus prefers moist and well drained soil of pH 6.0 to 8.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Gardenia (Gardenia)",
    "Image": "/Flowers/Gardenia.jpg",
    "Desc": " Gardenia is a genus of  about 140 species  of evergreen shrubs and small trees. It is a member of the  Rubiaceae family  and is native to the tropical and subtropical regions of Asia, Australasia, Oceania and Africa. \nThese plants are famous for their waxy, highly fragrant, white or cream flowers and deep, glossy green leaves. They will add charm, color and fragrance to your garden. Garden visitors, as well as pollinators, will enjoy their beautiful scented blooms! ",
    "PlantType": "Shrubs, Trees",
    "Color": "The most of them are white (or a related color like ivory or cream), but some of them are yellow.",
    "HardinessZones": "6-11",
    "BloomsIn": "Spring, Summer",
    "Height": "Gardenia grows between 60 cm (2 ft) and 6 metres (20 ft) tall, depending on species.",
    "SoilNeeds": "Gardenia likes moist, but well drained soil. The ideal soil pH is between 5.0 and 6.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "hard"
  },
  {
    "Name": "Gazania (Treasure Flower)",
    "Image": "/Flowers/Gazania.jpg",
    "Desc": " Gazania is a genus of  about 20 species  in the  family Asteraceae , native to southern Africa. \nGardeners love them for their large, unique patterned, daisy-like flowers in a wide variety of colors. The blooms, as with all the members of the daisy family, are actually flower heads composed of disk florets at the centre. These plants are considered annuals in the cool climates, but in warmer climates they are short-lived perennials. They are vibrant, drought tolerant and easy to maintain. It is always such a delight when they pop into bloom! ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers come in shades of yellow, orange, pink, red and white. The colors of the petals are bright and unique.",
    "HardinessZones": "8-11",
    "BloomsIn": "Spring, Autumn, Winter",
    "Height": "The plant grows up to 30 cm (1 ft) high.",
    "SoilNeeds": "Gazania will grow best in well-drained soil in full sun, with a pH level between 5.5 and 7.0.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Gentiana (Gentian)",
    "Image": "/Flowers/Gentiana.jpg",
    "Desc": " Gentiana is a large genus of  about 400 species  in the  family Gentianaceae , distributed around the world. These plants grow in a wide variety of habitats and occur on all continents except the Antarctica. \nThey have trumpet-shaped, bright colored flowers on short stalks. The flowers have 4 or 5 sepals and also the same number of stamens and petals. They are great for cut flowers and flower arrangements. ",
    "PlantType": "Annuals, Perennials",
    "Color": "Most of the species have beautiful, vivid blue flowers, but white, yellow, purple and red varieties are also available.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "These plants range from dwarf species just 5 cm (2 inches) tall to the larger varieties that grow up to 90 cm (3 ft) in height.",
    "SoilNeeds": "Gentiana will grow best in rich, moist and well drained soil, with a pH level between 5.0 and 7.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Geranium (Cranesbills)",
    "Image": "/Flowers/Geranium.jpg",
    "Desc": " Geranium, also known as Cranesbills, is a genus of  more than 400 species  of flowering plants that range in size, shape and color. Geranium belongs to the  Geraniaceae family  and is found widely throughout the temperate regions of the world or in high tropical areas. \nMost of these species have fanciful, aromatic foliage and saucer-shaped, radially symmetric flowers with five separate petals. These eye-catching plants are one of the most popular plants today widely used in beds, borders and containers. They are easy to grow and will typically bloom from spring to autumn. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers come in shades of white, red, blue, purple and pink.",
    "HardinessZones": "2-10",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "These plants grow between 15 and 120 cm (6 inches to 4 ft) in height.",
    "SoilNeeds": "Geranium will grow in almost any kind of soil. The ideal soil pH should be mildly acidic.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Gerbera (Gerbera)",
    "Image": "/Flowers/Gerbera.jpg",
    "Desc": " Gerbera is a genus of  about 40 species  of flowering plants in the  daisy family (Asteraceae) , native to tropical Asia and Africa. \nThese perennials bear a large capitulum with ray florets in various colors. The flower head is actually huge cluster of hundreds of tinier flowers making the flower head we used to know. Gerberas are beautiful indoor plants and one of the most popular cut flowers. Their large size and bright colors make them extremely attractive. ",
    "PlantType": "Perennials",
    "Color": "These flowers come in many different colors, except for blue.",
    "HardinessZones": "8-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The species are 20 to 45 cm (8-18 inches) tall. The flower heads vary from 7 to 12 centimeters (3 to 5 inches) in diameter.",
    "SoilNeeds": "Gerberas prefer rich and well drained soil, with lots of added organic matter. They grow best in a slightly acidic soil with a pH of 5.5 - 6.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Geum (Avens)",
    "Image": "/Flowers/Geum.jpg",
    "Desc": " Geum is a genus of  about 50 species  in the  family Rosaceae , widely distributed across the temperate regions of the world. \nGeum is a wonderful versatile plant that blooms in spring and summer. Also known as Avens, this perennial produces beautiful single or double flowers in a wide range of colors. The vibrant, brightly colored blooms are held above the foliage on erect, wiry stems, giving them a delicate, airy appearance. Geums are suitable for borders and rock gardens, but can be grown in containers as well. They are excellent in potted arrangements and make great cut flowers. ",
    "PlantType": "Perennials",
    "Color": "Geum comes in various colors including white, yellow, orange, pink and red.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Summer",
    "Height": "The plant grows up to 60 cm (2 ft) tall.",
    "SoilNeeds": "Geums prefer rich, moist and well drained soil, with a pH level between 5.5 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Gladiolus (Gladiola; Sword lily)",
    "Image": "/Flowers/Gladiolus.jpg",
    "Desc": " Gladiolus, sometimes called Sword lily, is a genus of  around 300 species  in the  family of Iridaceae . Most of them are native to sub-Saharan Africa and around 10 species are native to Eurasia. \nThese perennials produce narrow, blade-shaped leaves and attractive fragrant flowers on tall spikes . They are available in a wide range of colors and are popular both as garden flowers and cut flowers. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "The flowers range from white, yellow, pink and lavender to red, purple and even green.",
    "HardinessZones": "2-10",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Gladiolus grows between 60 to 180 cm (2 to 6 ft) in height.",
    "SoilNeeds": "These plants prefer moist and well drained soil, with a pH between 6.0 and 7.0.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Gloriosa (Flame Lily)",
    "Image": "/Flowers/Gloriosa.jpg",
    "Desc": " Gloriosa is a genus of  about 10 species  in the  family Colchicaceae , native to tropical Africa and Asia. They are classified as perennials, but are usually treated as half-hardy annuals. \nThey are known for their attractive, exotic-looking flowers that bloom from late spring to fall. These eye-catching climbers deserve pride of place in any garden with their vivid colors and distinctive shape. If you are looking for something special for your garden or home, or are finding it hard to find a particular plant that you’ve always wanted, Gloriosa is a perfect plant for you! ",
    "PlantType": "Annuals, Bulbs, Climbers, Perennials",
    "Color": "The flowers come in shades of red, orange, pink and yellow.",
    "HardinessZones": "8-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Gloriosa usually grows to about 3 m (10 ft), but sometimes reaches more than 3 m (10 ft) in height and requires a trellis or wall to climb on. Some species, such as Gloriosa lutea (Gloriosa Lily), are smaller in size.",
    "SoilNeeds": "The plant prefers rich, well-drained soil that retains moisture. It will perform best in neutral to alkaline soil ranging from 5.8 to 6.5 on the pH scale.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Gomphrena (Gomphrena)",
    "Image": "/Flowers/Gomphrena.jpg",
    "Desc": " Gomphrena is a genus of  more than 100 species  of flowering plants in the  family Amaranthaceae , distributed throughout the warm temperate, subtropical and tropical regions of the world. \nThe genus includes low-growing annuals and perennials that bloom in shades of white, yellow, pink, orange, red and purple. Some of the species are used as medicinal plants and a few are cultivated as ornamentals. These plants are drought tolerant and easy to grow. They are suitable for beds, borders, pots and window boxes, and are great for fresh-cut and dried floral arrangements. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers come in various colors including white, yellow, pink, orange, red and purple.",
    "HardinessZones": "2-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "These beautiful plants can reach up to 90 cm (3 ft) in height, but most of the species are smaller than that.",
    "SoilNeeds": "The plant is not fussy about the soil type as long as it is well drained. It grows best in full sun and is tolerant of dry soil and humidity.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Grevillea (Spider Flower; Silky Oak)",
    "Image": "/Flowers/Grevillea.jpg",
    "Desc": " Grevillea is a genus of  about 350 species  of flowering plants in the  Proteaceae family , primarily native to Australia. \nThey are highly valued for their exotically shaped, vividly colored and nectar-rich flowers. Their flowerheads, which open at varying times, are composed of many small flowers that come in a wide range of colors. These unique evergreen plants come in all shapes and sizes and have an extremely long season of bloom. They are often cultivated in ornamental purposes. ",
    "PlantType": "Shrubs, Trees",
    "Color": "Grevillea may be red, yellow, orange, purple and white.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The species range from small shrubs around 50 cm (20 inches) high to large trees up to 35 metres (115 ft) tall.",
    "SoilNeeds": "Grevillea grows in all types of soil, but prefers well-drained soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Gypsophila (Baby's Breath)",
    "Image": "/Flowers/Gypsophila.jpg",
    "Desc": " Gypsophila is a genus in the  Caryophyllaceae family , containing  about 100 species  of annuals and perennials native to Eurasia, Africa and Australia. \nPlants in the Gypsophila genus have lance-shaped leaves and numerous tiny white or pink flowers that typically grow on tall stems. They are often grown for decorative purposes and are commonly used as a cut flower to give a delicate look in arrangements and bouquets. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The plants have small white or pink flowers.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Summer",
    "Height": "Gypsophila range in size from 15 cm (6 inches) to 1 m (30 ft) tall.",
    "SoilNeeds": "Gypsophila tolerates any kind of soil, but good drainage is essential.  Some species prefer calcium-rich, alkaline soils.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Hamamelis (Witch Hazel)",
    "Image": "/Flowers/Hamamelis.jpg",
    "Desc": " Hamamelis, also known as Witch Hazel, is a genus of  only a few species  in the  family Hamamelidaceae , native to Eastern Asia and North America. \nThe genus contains deciduous shrubs and small trees, growing up to 8 m (26 ft) tall. This plant produces simple oval leaves and spider-like flowers arranged in clusters. Flowers have spicy fragrance and are borne on bare stems from autumn to early spring. Hamamelis is extremely frost resistant, subtle in color and very delicate in form, adding interest to the winter garden. ",
    "PlantType": "Shrubs, Trees",
    "Color": "Hamamelis flowers range in color from deep red to yellow.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Autumn, Winter",
    "Height": "The plant grows between 150 cm (5 ft) and 8 m (26 ft) in height, depending on the species.",
    "SoilNeeds": "Hamamelis likes fertile, moist and well drained soil, with a ph between 4.5. and 7.0. It tolerates deep soils over chalk.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Helenium (Sneezeweed)",
    "Image": "/Flowers/Helenium.jpg",
    "Desc": " Helenium is a genus of  about 40 species  in the family  Asteraceae , native to the Americas. \nHelenium produces bright green foliage and long, thin stalks with vibrant, daisy-like flowers that bloom in summer and fall. Each flower is actually a group of smaller flowers composed of a central circular group of tiny disk flowers (disk florets), and an outer ring of larger ray flowers (ray florets), the so-called “petals” that may face outward from the center or may droop downward. These sun-loving plants will add bright colors to your garden, attracting butterflies and other pollinators. ",
    "PlantType": "Annuals, Perennials",
    "Color": "Helenium flowers come in shades of yellow, orange, red and brown.",
    "HardinessZones": "3-8",
    "BloomsIn": "Autumn, Summer",
    "Height": "Helenium grows up to 150 cm (5 ft) tall.",
    "SoilNeeds": "Helenium likes moist and well drained soil, and will tolerate most pH levels.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Helianthus (Sunflower)",
    "Image": "/Flowers/Helianthus.jpg",
    "Desc": " Helianthus, better known as Sunflower, is a genus of  about 70 species  of annuals and perennials in the  daisy family (Asteraceae) , native to North America, with a few species from South America. \nSunflowers have big, daisy-like flowers in bright colors often with a contrasting darker centre and large, bristly, dark green leaves. These sun-loving plants are recognized worldwide for their beauty, as well as agricultural importance. ",
    "PlantType": "Annuals, Perennials",
    "Color": "Although yellow is the original color, Sunflowers also come in shades of cream, red, orange and purple that contrast with deep brown centers.",
    "HardinessZones": "3-9",
    "BloomsIn": "Autumn, Summer",
    "Height": "Although there are some dwarf species that grow 30-60 cm (1-2 ft) tall, Sunflowers are usually tall plants which can grow up to 3 metres (10 ft) in height.",
    "SoilNeeds": "Sunflowers grow best in fertile, well drained soil, with a pH range between 6.0 and 7.5.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Heliconia (Lobster Claw; False Bird of Paradise)",
    "Image": "/Flowers/Heliconia.jpg",
    "Desc": " Heliconia is a genus of  about 200 species  in the  family Heliconiaceae , native to the tropical Americas, with some species occurring in the Pacific Ocean. \nHeliconia is a beautiful, exotic looking plant with multi-color bracts and tiny, hidden flowers, some of which you can see peeking out from the upper bracts. The showy colored structures we call “flowers” are actually modified leaves, called bracts, which contain the small true flowers inside them. Heliconia is so unique that once you see it, you’ll never forget it! Appreciated for its glamorous appearance, Heliconia is the perfect addition to many different bouquets and arrangements. ",
    "PlantType": "Perennials",
    "Color": "The colors of the flowers range in hues of red, orange, pink, yellow and green.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Heliconias can vary in height from as small as 60 cm (2 ft) to 6 metres (20 ft), depending on species.",
    "SoilNeeds": "Heliconia prefers rich and well drained soil that stays consistently moist. The optimal pH range is between 5.0 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Helleborus (Hellebore; Christmas Rose)",
    "Image": "/Flowers/Helleborus.jpg",
    "Desc": " Helleborus, also known as Hellebore, is a genus of  about 20 species  of perennial herbs in the  family Ranunculaceae , native to Europe and Asia. \nThe plant produces individual flowers consisted of 5 sepals and cup-shaped nectaries. What we call flowers are actually sepals that enclose the petals and protect the true flowers, which are actually at the center of the sepals, consisting of a cluster of stamens and small and insignificant petals. The sepals are showy and come in a wide range of colors including purple, pink, green, yellow, white and black. ",
    "PlantType": "Perennials",
    "Color": "The flowers come in various colors, from purple to pink, green, yellow, white and even black.",
    "HardinessZones": "4-9",
    "BloomsIn": "Spring, Winter",
    "Height": "They range in size from 30 cm (1 ft) to 1,2 metres (4 ft) tall.",
    "SoilNeeds": "These plants prefer rich, moist and well-drained soil. They are tolerant of most soil types, but avoid planting them in dry or waterlogged soil.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Hibiscus (Rose mallow)",
    "Image": "/Flowers/Hibiscus.jpg",
    "Desc": " Hibiscus is a genus of  about   400 different species  in the  family Malvaceae , native to warm temperate and tropical regions. These plants can be woody shrubs or small trees, as well as annuals or perennials. \nIn the world of flowers, they are known for their colorful, large and trumpet-shaped flowers. These flowers will add color and interest to your garden, while also attracting hummingbirds and butterflies. ",
    "PlantType": "Annuals, Perennials, Shrubs, Trees",
    "Color": "The flowers come in a variety of colors, from red, orange, pink and yellow to white, purple and blue.",
    "HardinessZones": "4-11",
    "BloomsIn": "Autumn, Summer",
    "Height": "These beauties can reach heights up to 4 metres (13 ft).",
    "SoilNeeds": "Hibiscus likes moist and well drained soil, with a neutral to slightly acidic pH.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Hippeastrum (Amaryllis)",
    "Image": "/Flowers/Hippeastrum.jpg",
    "Desc": " Hippeastrum is a genus in the  family Amaryllidaceae  with  about 90 species  and more than 600 hybrids. It is native to tropical regions of the Mexico, Caribbean, and South America. \nHippeastrum is a perennial herbaceous bulbous plant that has large trumpet-shaped flowers in various patterns. The hybrids are even more extravagant. Hippeastrum is often, but incorrectly called Amaryllis. ",
    "PlantType": "Bulbs",
    "Color": "Hippeastrum comes in red, pink, salmon, orange, white, yellow and pale green colors.",
    "HardinessZones": "2-10",
    "BloomsIn": "Spring, Winter, Summer",
    "Height": "Hippeastrum grows from 30 cm to 90 cm (1 to 3 ft) high.",
    "SoilNeeds": "This plant will grow in moist and well drained soil that is acidic, alkaline or neutral.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Hosta (Plantain Lily)",
    "Image": "/Flowers/Hosta.jpg",
    "Desc": " Hosta is a genus of  about 30 species  of perennials in the  family Asparagaceae , native to northeast Asia. \nThese shade loving plants are widely known for their attractive and lush foliage in a variety of shapes, sizes and colors. Although they are generally grown for their foliage, their beautiful trumpet-shaped flowers will just add more charm. Hostas are much loved by bees and, occasionally, hummingbirds. They can turn a shady part of your yard into an elegant landscape! ",
    "PlantType": "Perennials",
    "Color": "These flowers are usually white, whitish with lavender lines or even purple.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Some varieties are short, while some can grow up to 180 cm (6 ft) tall.",
    "SoilNeeds": "Hosta can tolerate just about any soil, but does best in rich, moist and well-drained soil.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Hoya (Wax Plant)",
    "Image": "/Flowers/Hoya.jpg",
    "Desc": " Hoya is a genus composed of  about 200 species  in the family  Apocynaceae . The species can be found from India and China to Thailand, Malaysia, Philippines, Indonesia and Australia. \nThese slow growing plants have long, woody stems and fleshy leaves. The flowers are sweet-scented and star-shaped, usually with five thick and waxy petals. They are perfect for hanging baskets or in a vertical garden. ",
    "PlantType": "Climbers, Perennials, Shrubs",
    "Color": "The flowers are mostly white, but are also available in shades of pink, red, purple, orange and green.",
    "HardinessZones": "8-12",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "Hoya plants range in size from 10 cm (4 inches) to 3 meters (10 ft) in height.",
    "SoilNeeds": "The plant will grow best in moist and well drained soil, with a pH between 5.0 and 6.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Hyacinthus (Hyacinth)",
    "Image": "/Flowers/Hyacinthus.jpg",
    "Desc": " Hyacinthus is a small genus of  three species  of bulbous flowering plants in the  Asparagaceae family , native to Mediterranean and Middle East. \nThe plant has narrow leaves that are folded lengthwise, and highly attractive and fragrant flowers which are borne in a raceme cluster at the top of the leafless stems. Hyacinthus, commonly known as Hyacinth, is extremely popular and praised because of its unique, rich and heavy scent. Hyacinths are great for gardens, as well as for bouquets and arrangements. ",
    "PlantType": "Bulbs",
    "Color": "Hyacinth comes in many color varieties, such as purple, blue, white, yellow, red, pink and orange.",
    "HardinessZones": "4-8",
    "BloomsIn": "Spring",
    "Height": "Hyacinth can grow up to 30 cm (1 ft) in height.",
    "SoilNeeds": "These plants will perform well in moist and well drained soil that is neutral to slightly acidic.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Hydrangea (Hortensia)",
    "Image": "/Flowers/Hydrangea.jpg",
    "Desc": " Hydrangea is a genus of  about 70 species  of shrubs, trees and climbers in the  family Hydrangeaceae , native to southern and eastern Asia. \nThere are many varieties and different types of Hydrangeas. Their big, bushy head and charismatic flowering blooms in intense colors are magnificent for bouquets and arrangements. Hydrangeas are some of the most popular flowers around. These flowers bring timeless beauty and charm which makes them perfect for any setting! ",
    "PlantType": "Climbers, Shrubs, Trees",
    "Color": "The flowers come in shades of blue, purple, white, pink and red.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The species range in size from 60 cm to 12 metres (2 ft to 40 ft) in height, depending on species.",
    "SoilNeeds": "Hydrangea grows best in moist, but well drained soil.",
    "SunNeeds": "Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Hypericum (St. John’s Wort)",
    "Image": "/Flowers/Hypericum.jpg",
    "Desc": " Hypericum is a genus of  more than 200 species  of flowering plants in the  family Hypericaceae , growing in the temperate regions of Europe, northern Africa, and the Middle East. \nThey have five-petalled, bright yellow flowers, with prominent stamens which are often united in bundles. These plants have been of scientific interest due to their widespread use in folk medicine. Many species are cultivated as ornamentals. ",
    "PlantType": "Annuals, Perennials, Shrubs, Trees",
    "Color": "The flowers are generally yellow.",
    "HardinessZones": "4-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Hypericum can reach a height between 30 cm (1 ft) and 2 m (7 ft), depending on species.",
    "SoilNeeds": "Hypericum grows best in moist and well drained soil that has a pH between 5.5 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Hypoxis (Star Grass)",
    "Image": "/Flowers/Hypoxis.jpg",
    "Desc": " Hypoxis is a genus of  about 90 species  of perennials in the  family Hypoxidaceae , native to Africa, Asia, Australia and Americas. \nHypoxis is recognizable by its strap-like leaves and bright yellow star-like flowers which appear in the spring or early summer. The flowers usually have six tepals, rarely 4 or 8, held on stalks that are about the height of the leaves. These plants are short-lived and are pollinated by solitary and honey bees. ",
    "PlantType": "Perennials",
    "Color": "The flowers are bright yellow in color.",
    "HardinessZones": "5-10",
    "BloomsIn": "Spring, Summer",
    "Height": "Hypoxis plants usually grow to a height of 20 cm (8 inches).",
    "SoilNeeds": "Hypoxis grows best in moist areas with full sun. Most species are not fussy about the soil pH.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Hyssopus (Hyssop)",
    "Image": "/Flowers/Hyssopus.jpg",
    "Desc": " Hyssopus is a genus of  about 10 species  of herbaceous perennials and evergreen shrubs in the  family Lamiaceae , native to southern and eastern Europe and the temperate zones of Asia. \nThe plant has erect, branched stems, small narrow leaves and double-lipped flowers that are highly attractive to hummingbirds, bees and other pollinators. ",
    "PlantType": "Perennials, Shrubs",
    "Color": "The flowers are usually purple and blue, or rarely pink and white.",
    "HardinessZones": "3-10",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The plant usually grows to a height of 60 cm (2 ft).",
    "SoilNeeds": "Hyssopus thrives in sunny or partially shaded areas with well drained, moist or dry soil. It is an adaptable plant that grows in sandy or loamy soils and tolerates a pH range from 5.0 to 8.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Iberis (Candytuft)",
    "Image": "/Flowers/Iberis.jpg",
    "Desc": " Iberis, also known as Candytuft, is a genus of  about 50 species  in the  family Brassicaceae , native to Asia and Europe with many of the species native to the Mediterranean region. \nIberis has dark green leaves and racemes of small, but showy flowers. These low growing plants are often grown as a ground cover or as edging along pathways. ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "The flowers are usually white, but can also be pink or lilac.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Summer",
    "Height": "The plant can reach a height between 15 cm (6 inches) and 30cm (1 ft).",
    "SoilNeeds": "Iberis likes rich, moist and well drained soil. Some species can grow in nutritionally poor soil.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Impatiens (Jewelweed; Touch-me-not; Busy Lizzy)",
    "Image": "/Flowers/Impatiens.jpg",
    "Desc": " Impatiens is a huge genus of  about 1000 species  of flowering plants in the  family Balsaminaceae , native to northern hemisphere and tropic areas. They can be both annuals and perennials. \nThese shade-loving plants are very colorful and will bloom all season long. Their long-lasting blooms are rich, vibrant, very bright and are good for attracting hummingbirds. They are great in pots, window boxes, hanging baskets, borders and as ground covers. ",
    "PlantType": "Annuals, Perennials",
    "Color": "These flowers are available in a variety of colors including blue, purple, orange, red, pink, white and yellow.",
    "HardinessZones": "8-12",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "They are short plants that usually don't grow larger than 30 cm (1 ft).",
    "SoilNeeds": "These plants prefer rich, moist and well drained soil, with a pH between 6.0 and 7.5.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Ipomoea (Morning Glory; Kangkung)",
    "Image": "/Flowers/Ipomoea.jpg",
    "Desc": " Ipomoea is a large genus in the  family Convolvulaceae , native to tropical and subtropical America. The genus comprises  more than 500 species  of herbaceous plants, climbers, shrubs and trees. \nIpomoea produces beautiful and showy, funnel-shaped flowers in a variety of colors. This plant is valuable due to its abundant flowering and rapid growth. Its impressive flowers attract pollinators, such as hummingbirds, bees, moths and other insects. ",
    "PlantType": "Annuals, Climbers, Perennials, Shrubs, Trees",
    "Color": "The flowers come in many colors including white, red, blue, purple and yellow.",
    "HardinessZones": "2-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "These plants vary in size from 20 cm (8 inches) to 4,5 metres (15 ft) in height.",
    "SoilNeeds": "The plant is very adaptable and will grow in almost any type of soil that is well drained.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Iris (Iris)",
    "Image": "/Flowers/Iris.jpg",
    "Desc": " Iris is a genus of  about 300 species  in the  family of Iridaceae , native to the northern hemisphere. \nIrises are well-known flowers and one of the most rewarding and easy-to-grow plants. They are popular because of their beautifully shaped and multi-colored blooms. These spectacular flowers will brighten up your garden and provide a cheerful color, often all the way through winter. ",
    "PlantType": "Perennials",
    "Color": "Iris comes in a rainbow of colors including blue, purple, white, yellow, pink, orange, brown, red and black.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "Irises are available in different sizes, which range from dwarf species (5 cm or 2 inches) to much larger varieties (130 cm or 4 ft).",
    "SoilNeeds": "Iris performs best in moist and well drained soil that is slightly acidic.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Ixora (Jungle Flame; Flame of the Woods)",
    "Image": "/Flowers/Ixora.jpg",
    "Desc": " Ixora is a genus in the  Rubiaceae family , native to the tropical and subtropical regions. It is a large genus containing  about 550 species  of shrubs and small trees. \nIxora is a popular flowering plant among gardeners because of its rounded shape, showy flowers and attractive, glossy foliage. ",
    "PlantType": "Shrubs, Trees",
    "Color": "Ixora comes in bright red, orange, pink, yellow and white colors. The red color is the most common color.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Summer",
    "Height": "Ixora grows up to 200 cm (7 ft) in height.",
    "SoilNeeds": "Ixora likes moist, but well drained soil. It should be planted in rich, acidic soil because alkaline soil can result in yellow foliage.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Jacaranda (Jacaranda)",
    "Image": "/Flowers/Jacaranda.jpg",
    "Desc": " Jacaranda is a genus of  about 50 species  of flowering shrubs and trees in the  family Bignoniaceae . Although native to Central and South America, Jacaranda has been planted widely in Asia and Australia. \nThe species have fern-like, dark green foliage and dense clusters of soft, purple-blue trumpet flowers that make a showy display in spring and early summer. Jacaranda trees can grow up to 10 metres (32 ft) in height, which makes them an excellent shade or street trees. ",
    "PlantType": "Shrubs, Trees",
    "Color": "These flowers come in shades of purple and blue.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Summer",
    "Height": "These plants grow between 1 and 10 metres (3-32 ft) tall, depending on species.",
    "SoilNeeds": "Although Jacaranda tolerates a wide variety of soils, it grows best in sandy soil, with a slightly acidic pH range.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Jasione (Jasione)",
    "Image": "/Flowers/Jasione.jpg",
    "Desc": " Jasione is a genus of  about 15 species  of flowering plants in the  family Campanulaceae , native to Europe and Middle East. The most popular species are Jasione Montana and Jasione Laevis. \nThese plants have spherical, pincushion-like flowers, subtended by involucral bracts. They are good as cut flowers, in borders or rock gardens. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers are blue or purple in color,",
    "HardinessZones": "4-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Jasione can grow up to 50 cm (2 ft) in height.",
    "SoilNeeds": "This plant needs well drained soil. It is not fussy about soil pH",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Jasminum (Jasmine)",
    "Image": "/Flowers/Jasminum.jpg",
    "Desc": " Jasminum, commonly called Jasmine, is a genus of  about 200 species  in the  family Oleaceae , native to tropical and subtropical climates of Eurasia, Australasia and Oceania. \nJasmine is a climbing, deciduous shrub that is grown mainly for its star-shaped, fragrant flowers. The flowers are white in most species, with some species being yellow. It’s a very popular flower, especially because of its unique, strong and sweet fragrance. It is great for any garden or landscape. ",
    "PlantType": "Climbers, Shrubs",
    "Color": "Most of the Jasmine species bear white or pale yellow flowers.",
    "HardinessZones": "6-11",
    "BloomsIn": "Spring, Summer",
    "Height": "Growing approximately 30-60 cm (1-2 ft) per year, Jasmines can reach 150 cm (5 ft) tall as a shrub and over 10 m (33 ft) as a vine.",
    "SoilNeeds": "Jasmine likes fertile and moist, but well drained soil. The ideal soil pH is between 6.0 and 7.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Justicia (Jacobinia)",
    "Image": "/Flowers/Justicia.jpg",
    "Desc": " Justicia is a large genus of  about 600 species  of evergreen perennials and shrubs in the  family Acanthaceae , native to Americas, Africa and India. \nJusticia has unusual spikes of tubular flower clusters, and leaves which are often strongly veined. This attractive shade-loving plant is easy to grow and easy to propagate. ",
    "PlantType": "Perennials, Shrubs",
    "Color": "Justicia comes in shades of red, orange, pink, yellow, white and cream.",
    "HardinessZones": "8-12",
    "BloomsIn": "Summer",
    "Height": "The smaller types grow in mounds about 50 cm (2 ft) high, while others are more shrublike and grow up to 2,5 metres (8 ft) tall.",
    "SoilNeeds": "Justicia prefers well drained, acidic to neutral soil.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Kalanchoe (Kalanchoe)",
    "Image": "/Flowers/Kalanchoe.jpg",
    "Desc": " Kalanchoe is a genus of  about 125 species  of succulent flowering plants native to Madagascar, a large island in the Indian Ocean off the southeast coast of Africa. They belong to the  family Crassulaceae  and most of them are shrubs and perennial herbaceous plants. \nKalanchoes are known for their large thick leaves and showy, colorful blooms. They are available in a wide range of sizes, shapes and colors. ",
    "PlantType": "Cactus - Succulents, Perennials, Shrubs",
    "Color": "Kalanchoe comes in a variety of colors, including orange, pink, red, white and many variations thereof.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "Most species are less than 1 m (3 ft), with the exception of Kalanchoe beharensis from Madagascar which can reach the height of 6 m (20 ft).",
    "SoilNeeds": "These plants do best in well drained soil, with a pH level between 5.0 and 6.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Kalmia (Spoonwood)",
    "Image": "/Flowers/Kalmia.jpg",
    "Desc": " Kalmia is a genus composed of  about 10 species  in the  family Ericaceae , which are found in North America. \nThese evergreen shrubs produce attractive leathery leaves and clusters of showy, beautiful bowl-shaped flowers. Kalmias are well-known ornamentals and popular garden plants. ",
    "PlantType": "Shrubs",
    "Color": "The flowers are usually pink, purple, lavender or white.",
    "HardinessZones": "4-9",
    "BloomsIn": "Spring, Summer",
    "Height": "These plants range from 25 cm (1 ft) to 5 metres (16 ft) in height.",
    "SoilNeeds": "The plant prefers moist, well drained and acidic soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Kerria (Japanese kerria; Japanese rose)",
    "Image": "/Flowers/Kerria.jpg",
    "Desc": " Kerria is a genus of  one species – Kerria japonica , in the  family Rosaceae , found in the East Asia. \nKerria japonica is a spring-flowering deciduous shrub that produces 5-petaled, bright yellow flowers and sharply toothed leaves. Although the primary bloom period is spring, it still blooms sporadically throughout the summer, creating a colorful show. ",
    "PlantType": "Shrubs",
    "Color": "These flowers are bright yellow in color.",
    "HardinessZones": "4-9",
    "BloomsIn": "Spring, Summer",
    "Height": "Kerria grows up to 3 metres (10 ft) in height.",
    "SoilNeeds": "Kerria japonica grows best in moist, well drained and slightly acidic soil.",
    "SunNeeds": "Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Kniphofia (Red Hot Pokers; Torch Lily; Tritoma)",
    "Image": "/Flowers/Kniphofia.jpg",
    "Desc": " Kniphofia is a genus of  about 70 species  of flowering plants in the  family Asphodelaceae , native to Africa and Middle East. \nKniphofias have large, narrow, grass-like leaves and dense spikes of small, tubular flowers that bloom from early spring to autumn. When in bloom, the flowers produce an abundance of nectar, which attracts bees and butterflies. They are great garden plants, but can also be grown in pots and containers. ",
    "PlantType": "Perennials",
    "Color": "Kniphofia blooms in shades of red, orange, yellow and cream. They change color as the flower matures, which results in a bicolor look.",
    "HardinessZones": "5-10",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Kniphofia grows up to 2 metres (7 ft) high.",
    "SoilNeeds": "The plant will grow in moist and well drained soil that is neutral, alkaline or acidic.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Kolkwitzia (Beauty Bush)",
    "Image": "/Flowers/Kolkwitzia.jpg",
    "Desc": " Kolkwitzia is a genus of only  one species – Kolkwitzia amabilis , a deciduous shrub originated in China. Kolkwitzia is a member of the  Caprifoliaceae family , also known as the honeysuckle family. \nIt produces clusters of bell-shaped, white or pink flowers with a yellow throat, and opposite dark green leaves. This beautiful and adaptable beauty is perfect for any garden! ",
    "PlantType": "Shrubs",
    "Color": "The flowers are soft pink to white, each with a yellow troat.",
    "HardinessZones": "4-8",
    "BloomsIn": "Spring, Summer",
    "Height": "Kolkwitzia amabilis grows up to 3 metres (10 ft) in height.",
    "SoilNeeds": "The plant prefers fertile and moist, but well drained soil. It can tolerate acid to alkaline soil, with a pH between 5.0 and 8.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Kunzea (Kunzea)",
    "Image": "/Flowers/Kunzea.jpg",
    "Desc": " Kunzea is a genus of  about 40 species  of shrubs and small trees in the  family Myrtaceae , native to Australia and New Zealand. \nKunzea flowers are arranged in clusters and have five petals, five sepals and a large number of stamens. The flowers, which are rich in nectar, attract beneficial insects and nectar loving birds. ",
    "PlantType": "Shrubs, Trees",
    "Color": "Kunzea flowers come in various colors including white, yellow, pink, purple and red.",
    "HardinessZones": "7-10",
    "BloomsIn": "Autumn, Winter, Summer",
    "Height": "They range in size from small ground covers to 10 metre (32 ft) trees.",
    "SoilNeeds": "Kunzeas prefer moist and well drained soil, but will grow in a variety of soils with a pH range of 6.0 to 8.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Lantana (Shrub Verbena)",
    "Image": "/Flowers/Lantana.jpg",
    "Desc": " Lantana is a genus of  more than 150 species  of flowering plants in the  family Verbenaceae , native to tropical areas of South Africa and America. \nThe plant grows as an evergreen or deciduous shrub and blooms in beautiful and vibrant colors all season long, changing the intensity of colors as the flower matures. Lantana produces many individual tubular-shaped flowers in clusters, with four petals each. These bright, sun-loving plants are great in beds, borders, containers or as ground cover, where they will attract hummingbirds and butterflies. ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "Lantana comes in a rainbow of colors including red, orange, pink, lavender, yellow, white or a mixture of these and will often display different colors in the center and on the edges.",
    "HardinessZones": "8-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The species range in size from 25 cm to 1,2 metres (10 inches to 4 ft) tall.",
    "SoilNeeds": "Lantana prefers moist, but well drained soil, with a pH between 6.5 and 7.5.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Lathyrus (Sweet Pea )",
    "Image": "/Flowers/Lathyrus.jpg",
    "Desc": " Lathyrus, also known as Sweet Pea, is a genus of  about 150 species  in the  family Fabaceae , mostly native to the mediterranean region. \nThe flowers of the plant are unique, usually with 5 petals that form a butterfly-shaped structure – one large banner petal, two horizontal petals and two lower petals. They are often fragrant and come in a rainbow of colors and patterns. ",
    "PlantType": "Annuals, Climbers, Perennials",
    "Color": "The flowers come in a wide variety of colors, including white, cream, yellow, red, scarlet, pink, salmon, magenta, purple, lavender and blue.",
    "HardinessZones": "2-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The species range from 30 cm (1 ft) to 280 cm (9 ft) tall, depending on variety.",
    "SoilNeeds": "The plant grows in moist and well drained soil and will survive in acid, alkaline and neutral soil.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Lavandula (Lavender)",
    "Image": "/Flowers/Lavandula.jpg",
    "Desc": " Lavandula is a genus of  about 50 species  of flowering plants in the  family Lamiaceae , native to Mediterranean. \nThe plant produces gray-green foliage and purple or blue flowers in blunt spikes on long stems. Its beautiful scent attracts many pollinators and hummingbirds. Lavender is famous for its beauty, fragrance and healing properties, although it is best known as an aromatic plant. ",
    "PlantType": "Herbs, Perennials, Shrubs",
    "Color": "Lavender comes in a wide range of purple colors, but also can be found in white, pink and blue.",
    "HardinessZones": "5-10",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Lavender grows from 30 to 90 cm (1 to 3 ft) tall.",
    "SoilNeeds": "This plant will do best in well drained soil that is neutral to slightly alkaline. The ideal pH level is somewhere between 6.5 and 7.5.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "medium"
  },
  {
    "Name": "Leontopodium (Edelweiss)",
    "Image": "/Flowers/Leontopodium.jpg",
    "Desc": " Leontopodium is a genus of  about 40 species  of perennials in the  family Asteraceae , native to Europe and Asia. These plants can be found in many challenging environments, usually growing in limestone soil on mountain meadows at altitudes between 1500 and 3000 m. \nThe true flowers are short lived, yellow and tiny, surrounded by white petals that form a star-like formation. They bloom from late spring to early autumn and are easy to care for. ",
    "PlantType": "Perennials",
    "Color": "This plant has small, yellow clustered florets.",
    "HardinessZones": "4-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The plant reaches about 30 cm (1 ft) in height.",
    "SoilNeeds": "Leontopodium needs good drainage and pH between 6.5 and 7.5 (slightly alkaline to medium acidity).",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Leucojum (Snowflake)",
    "Image": "/Flowers/Leucojum.jpg",
    "Desc": " Leucojum is a genus of only  two species  in the  family Amaryllidaceae  – Leucojum vernum and Leucojum aestivum, both native to Eurasia. \nThese bulbous perennials have grass-like foliage and pendulous, white and bell-shaped flowers, which are marked on all six petal tips with green or yellow-green marks. They are small, but very pretty and fragrant! ",
    "PlantType": "Bulbs, Perennials",
    "Color": "Leucojum has white flowers with faint green tips.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Summer",
    "Height": "Leucojum grows up to 60 cm (2 ft) high.",
    "SoilNeeds": "These plants are not fussy about soil type, but they bloom best in a soil that is rich, moist and well-drained.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Lewisia (Lewisia)",
    "Image": "/Flowers/Lewisia.jpg",
    "Desc": " Lewisia is a genus of  about 20 species  of perennials in the  family Montiaceae , all native to western North America. \nThese low-growing plants are known for their attractive, fleshy leaves and large flowers in a variety of colors. The flowers are cup-shaped and have many petals. The most popular species are Lewisia cotyledon, also known as Cliff Maid, and Lewisia rediviva, commonly called Bitterroot. ",
    "PlantType": "Perennials",
    "Color": "The flowers come in shades of white, pink, purple, orange and red.",
    "HardinessZones": "3-8",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Lewisia is a small plant, growing up to 30 cm (1 ft) in height.",
    "SoilNeeds": "Lewisia prefers moderately fertile and well drained soil, with a ph value between 5.0 and 8.0. It is drought tolerant and thrives in poor and dry soils.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Liatris (Blazing Star; Gayfeather)",
    "Image": "/Flowers/Liatris.jpg",
    "Desc": " Liatris is a genus of  about 50 species  of perennial plants in the  family Asteraceae , native to North America, Mexico and Bahamas. \nThese prairie wildflowers have spiky or feathery flowers and long narrow leaves growing up along the stem. Liatris makes a beautiful appearance in late summer and early fall. It is an excellent choice for almost any garden. ",
    "PlantType": "Perennials",
    "Color": "The flowers come in shades of purple, lavender, pink, white, rose and violet.",
    "HardinessZones": "3-10",
    "BloomsIn": "Autumn, Summer",
    "Height": "The plant grows up to 150 cm (5 ft) in height.",
    "SoilNeeds": "Liatris will grow best in sandy or loamy soil, with a pH between 5.5 and 7.5. Plant Liatris in tough soil conditions with good drainage.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Lilium (Lily)",
    "Image": "/Flowers/Lilium.jpg",
    "Desc": " Lilium is a genus of  about 100 species  of bulbous perennials that come in different shapes and colors. The genus belongs to the  family Liliaceae  and is native to the northern hemisphere. \nThey are erect perennials with usually narrow leaves and flowers characterized by six petal-like segments (three petals in addition to three sepals) which may form the shape of a trumpet. Most of them are elegant, bright colored and fragrant. Throughout history, Lilium has been a powerful symbol in cultures around the world. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "Lilies come in a large variety of colors and the most common are white, yellow, orange and red.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Some species are small, about 30 cm or 1 ft (such as Dwarf Asiatic Lilies), while others can reach a height of 270 cm or 9 ft (Lilium Superbum).",
    "SoilNeeds": "Most Lilies prefer moist and well drained soil and they will perform best in soil that is slightly acidic.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Limonium (Sea Lavender; Statice)",
    "Image": "/Flowers/Limonium.jpg",
    "Desc": " Limonium, also known as Sea Lavender, is a genus of  about 120 species  in the  family Plumbaginaceae , native to the Mediterranean region and central Asia. \nLimonium is a tall plant with a cluster of small flowers sitting atop sturdy stems. It comes in a wonderful range of colors and is easy to maintain. The flowers are widely used in fresh and dried flower arrangements, but are also beautiful in the garden. ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "The flowers are blue, purple, pink, yellow or white.",
    "HardinessZones": "3-11",
    "BloomsIn": "Spring, Summer",
    "Height": "The plant grows up to 90 cm (3 ft) in height.",
    "SoilNeeds": "Limonium prefers rich and well-drained soil in full sun. It is not particular as to soil pH.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Lobelia (Lobelia)",
    "Image": "/Flowers/Lobelia.jpg",
    "Desc": " Lobelia is a genus of  more than 400 species  in the  family Campanulaceae , widely distributed all over the world. \nLobelia produces lovely flowers that attract butterflies, hummingbirds and beneficial insects. The flowers are comprised of five petals, the “upper lip” of two petals and a “lower lip” of three petals, all joined in a long nectar tube. The upper two petals are thin and upright, while the three lower petals are much larger and wider. Lobelia is a popular garden plant which enhances the beauty of any garden! ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "The flowers come in shades of blue, white, pink, red and purple.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The plant ranges in height from 15 cm (6 inches) to 150 cm (5 ft), depending on species.",
    "SoilNeeds": "Lobelia prefers rich, moist and well drained soil, with a pH level from 6.0 to 7.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Lonicera (Honeysuckle)",
    "Image": "/Flowers/Lonicera.jpg",
    "Desc": " Lonicera, commonly known as Honeysuckle, is a genus of  about 100 species  of shrubs and climbers in the  family Caprifoliaceae , native to northern hemisphere. \nHoneysuckle produces opposite, simple and oval leaves and colorful, trumpet-shaped or tube-shaped flowers. The flowers grow in clusters at the branch tips and come in various colors, from white to deep red. They are a popular nectar source for butterflies and bees, and most of them are heavily scented. ",
    "PlantType": "Climbers, Shrubs",
    "Color": "The flowers come in shades of white, yellow, pink, orange and red.",
    "HardinessZones": "2-10",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "Honeysuckles range in height from 60 cm (2 ft) to 9 m (30 ft) tall.",
    "SoilNeeds": "Some species prefer fertile, rich, moist and well-drained soil, while others will grow in any well-drained soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Lupinus (Lupine; Lupin)",
    "Image": "/Flowers/Lupinus.jpg",
    "Desc": " Lupinus is a genus of  about 500 species  of flowering plants in the  Fabaceae family , native to the Mediterranean, North Africa, Australasia and Americas. The genus contains both annual and perennial species. \nThese striking plants have stiff, erect flower spikes that emerge from horizontal foliage. The flowers are pea-like and grow in large, crowded racemes. They are perfect for attracting bees, hummingbirds and butterflies. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers are usually blue or purple, but sometimes pink, yellow and white.",
    "HardinessZones": "4-8",
    "BloomsIn": "Spring, Summer",
    "Height": "Lupinus grows from 30 cm to 1,5 m (1 to 5 ft) tall, depending on species.",
    "SoilNeeds": "Lupinus grows best in well drained, neutral to slightly acidic soil. The ideal pH is between 5.5 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Lycoris (Spider Lily)",
    "Image": "/Flowers/Lycoris.jpg",
    "Desc": " Lycoris is a genus of  about   20 species  of perennials in the  family Amaryllidaceae , native to Eastern Asia, mainly China and Japan. \nMost species have flowers with narrow, strap-like petals and long stamens that give them their spidery appearance. The flowers come in many colors and will bring cheer to everyone who sees them! ",
    "PlantType": "Bulbs, Perennials",
    "Color": "The flowers come in shades of red, pink, orange, white and yellow.",
    "HardinessZones": "5-10",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Lycoris grows up to 60 cm (2 ft) in height.",
    "SoilNeeds": "The plant prefers soils that are rich and well-drained, with medium moisture. It is not fussy about the soil pH.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Magnolia (Magnolia)",
    "Image": "/Flowers/Magnolia.jpg",
    "Desc": " Magnolia is a genus of  more than 200 species  in the  family of Magnoliaceae . They are native to tropical, subtropical and temperate regions of Asia and Central America. \nGrowing as shrubs or trees, Magnolias are well known for their beautiful, showy and fragrant flowers and attractive, evergreen and glossy leaves. They are one of the loveliest garden plants! ",
    "PlantType": "Shrubs, Trees",
    "Color": "Magnolia produces white, purple, pink and yellow flowers, depending on variety.",
    "HardinessZones": "4-9",
    "BloomsIn": "Spring, Summer",
    "Height": "The trees can grow to a height of 20 metres (65 ft), while shrubs are smaller and are 2,5 to 6 metres (8-20 ft) high.",
    "SoilNeeds": "Magnolia grows best in rich, moist and well drained soil. They prefer acidic soil, but can tolerate clay, loam, or sand.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Malva (Mallow)",
    "Image": "/Flowers/Malva.jpg",
    "Desc": " Malva, commonly known as Mallow, is a genus of  about 30 species  of herbaceous plants in the  family Malvaceae , native to Europe, northern Africa and temperate Asia. \nThe plant produces beautiful, eye-catching, cup-shaped flowers in romantic shades. All Mallow flowers have five petals and vary in color from pink to purple and white. Mallow is a great border plant that will add color to any garden! ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers are usually pink, purple and white.",
    "HardinessZones": "3-10",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "This plant grows up to 150 cm (5 ft) in height, but most of the species are smaller than that.",
    "SoilNeeds": "Mallow likes rich and well-drained soil, even slightly dry and poor. Most species prefer neutral to slightly acidic pH.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Mandevilla (Dipladenia; Rocktrumpet)",
    "Image": "/Flowers/Mandevilla.jpg",
    "Desc": " Mandevilla is a genus of  about 200 species  of climbing perennials in the  family Apocynaceae , mostly native to South America. \nThese tropical vines are one of the most versatile plants you can grow in your summer garden. Their beautiful, showy flowers bloom in various colors and shades and form a conspicuous contrast to the green foliage, adding a tropical flair to any landscape. ",
    "PlantType": "Annuals, Climbers, Perennials",
    "Color": "The flowers come in shades of red, pink, white and yellow.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The species can grow up to 6 metres (20 ft) in height, or even more.",
    "SoilNeeds": "Mandevilla prefers rich, sandy and well drained soil with organic material added.",
    "SunNeeds": "Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Mimosa (Mimosa)",
    "Image": "/Flowers/Mimosa.jpg",
    "Desc": " Mimosa is a large genus of about  400 species  in the  family Fabaceae , native to tropical and subtropical areas throughout the world. Most of the species are herbs and undershrubs, but some are woody climbers or even trees. \nMimosas have round clusters of numerous flowers held on a single head. Each flower has long stamens forming a fluffy spherical head. Their beautiful leaves and clusters of fragrant flowers make them popular ornamentals. ",
    "PlantType": "Annuals, Perennials, Shrubs, Trees",
    "Color": "The flowers come in shades of pink, purple and white.",
    "HardinessZones": "9-13",
    "BloomsIn": "Summer",
    "Height": "They can be found in various sizes and some (Mimosa pigra) may grow as large as 6 m (20 ft) tall.",
    "SoilNeeds": "Mimosa grows best in moist and well-drained loamy soil. The ideal soil pH is between 5.0 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Monarda (Bee Balm; Bergamot)",
    "Image": "/Flowers/Monarda.jpg",
    "Desc": " Monarda is a genus of  about 20 species  of flowering plants in the  family Lamiaceae , native to North America. \nMonarda grows in dense clusters with colorful, striking flowers that bloom in summer and early autumn, surrounded by leaf-like bracts. This plant is a good choice for perennial borders, cottage gardens and butterfly gardens. The flowers are magnets for pollinators such as butterflies, hummingbirds and bees. ",
    "PlantType": "Perennials",
    "Color": "These flowers come in shades of red, pink, purple and white.",
    "HardinessZones": "3-9",
    "BloomsIn": "Autumn, Summer",
    "Height": "Different varieties vary in height from dwarf species barely 25 cm (10 inches) tall to \"giants\" that reach about 1,5 metres (5 ft) high.",
    "SoilNeeds": "Monarda prefers well drained soil, with a pH from 6.0 to 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Muscari (Grape Hyacinth)",
    "Image": "/Flowers/Muscari.jpg",
    "Desc": " Muscari is a genus of  about 40 species  of perennial bulbous plants in the  Asparagaceae family , native to Eurasia. \nMuscari produces urn-shaped spikes of fragrant flowers resembling bunches of grapes. These plants are easy to grow and are great for beds, borders and under shrubs or trees. They are excellent as cut flowers and especially as rock-garden plants. ",
    "PlantType": "Bulbs",
    "Color": "These flowers are commonly blue. However, the white, pink and yellow types can also be found.",
    "HardinessZones": "4-9",
    "BloomsIn": "Spring",
    "Height": "Muscari is a small plant that grows between 10 cm (4 inches) and 25 cm (10 inches) tall.",
    "SoilNeeds": "The plant grows best in moist and well drained soil, with a pH between 6.0 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Myosotis (Forget Me Not; Scorpion Grass)",
    "Image": "/Flowers/Myosotis.jpg",
    "Desc": " Myosotis is a genus of  about 50 species  of perennials in the  family Boraginaceae , native to Europe and Asia. \nThis beautiful plant has five petals and five sepals and is best seen from May through October. Its charming tiny flowers are mostly blue, but also occur in white and pink. Myosotis is great for garden beds, rock gardens or in containers. It will add color and texture to any garden! ",
    "PlantType": "Perennials",
    "Color": "The flowers are usually blue, but may be pink or white, sometimes with a yellow center.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Summer",
    "Height": "Myosotis can reach about 30 cm (1 ft) in height.",
    "SoilNeeds": "The plant performs best in rich, moist and well drained soil, with a pH between 5.5 and 7.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Myrtus (Myrtle)",
    "Image": "/Flowers/Myrtus.jpg",
    "Desc": " Myrtus is a genus of  three species  in the  family Myrtaceae  – Myrtus Communis, Myrtus Nivellei and Myrtus phillyreifolia, all native to Mediterranean, northern Africa and western Asia<em>. \n</em>These shrubs or small trees produce small, aromatic, glossy leaves and beautiful white flowers on short flower stalks in spring and summer. The flowers are usually small and contain five sepals and five petals. This popular plant is cultivated in ornamental purposes and as a source of aromatic oils. ",
    "PlantType": "Shrubs, Trees",
    "Color": "The flowers are most commonly white.",
    "HardinessZones": "8-9",
    "BloomsIn": "Spring, Summer",
    "Height": "Myrtle grows up to 6 metres (20 ft) in height.",
    "SoilNeeds": "Myrtle likes moist and well drained soil. The ideal pH value is between 6.0 and 8.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Narcissus (Daffodil)",
    "Image": "/Flowers/Narcissus.jpg",
    "Desc": " Narcissus is a genus of bulbous perennials in the  Amaryllidaceae family . There are  more than 100 species  of this plant, which is native to Europe, Asia and North Africa. \nNarcissi are usually white or yellow, with six petals (technically, “tepals” or “perianth segments”) and a trumpet-shaped central corona. They are some of the first to bloom in the early spring, announcing the end of winter. Narcissus is one of the most popular flowers in the world, mainly due to the well-known myth of the Greek youth who fell in love with himself. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "These flowers are usually white and yellow.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring",
    "Height": "Some species can reach a height of 10 cm (4 inches), while others can grow up to 90 cm (3 ft) tall.",
    "SoilNeeds": "These plants prefer rich and moist, but well-drained soil and will grow best in soil that is neutral to slightly acidic (pH of 6.0 to 7.0).",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Nelumbo (Lotus)",
    "Image": "/Flowers/Nelumbo.jpg",
    "Desc": " Nelumbo, commonly called Lotus, is a genus of aquatic plants containing only  two species  – Nelumbo nucifera and Nelumbo lutea, which belong to the  Nelumbonaceae family . These plants are aquatic perennials native to tropical Asia and Australia (Nelumbo nucifera) and North America (Nelumbo lutea), growing in the mud of lagoons, lakes, swamps, ponds and waterlogged fields. \nThey have wide and disc-shaped leaves at or above the water surface, and beautiful flowers rising above the water. The flowers are large and usually found on thick stems. These beauties will attract birds and insects, as well as people! ",
    "PlantType": "Perennials",
    "Color": "Nelumbo nucifera has white or pink flowers, while Nelumbo lutea has yellow ones.",
    "HardinessZones": "4-10",
    "BloomsIn": "Spring, Summer",
    "Height": "The leaves and flowers of Nelumbo nucifera are held on stems up to 2 metres (7 ft) tall. The Nelumbo lutea are almost the same size, ranging from 80 cm to 1,5 metres (3-5 ft) in height.",
    "SoilNeeds": "Both species need rich and loamy soil. The optimal soil pH is between 6.5 and 8.0.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Nemesia (Nemesia)",
    "Image": "/Flowers/Nemesia.jpg",
    "Desc": " Nemesia is a genus of  about 70 species  of annuals, perennials and sub-shrubs in the  family Scrophulariaceae , native to southern Africa. The most popular species are Nemesia strumosa, Nemesia caerulea and Nemesia fruticans. \nNemesia has lance-shaped, sometimes toothed leaves and pretty little flowers that bloom in a wide range of colors. Nemesia charms everyone with its colorful and long-lasting flowers! Some varieties are sweetly scented and quite beautiful. These plants can be used as edging plants, ground covers or hanging basket plants. ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "These flowers come in shades of blue, purple, red, pink, orange, mauve, yellow, cream and white.",
    "HardinessZones": "8-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The half-inch flowers bloom on plants that grow up to 60 cm (2 ft) tall.",
    "SoilNeeds": "Nemesia likes moist and well drained soil. The ideal soil pH is between 5.5 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Nemophila (Baby Blue Eyes)",
    "Image": "/Flowers/Nemophila.jpg",
    "Desc": " Nemophila is a genus of  about 10 species  of annuals in the  family Boraginaceae , native to western North America. \nNemophila has delicate, five-petaled, cup-shaped flowers in shades of blue, white and purple. These gorgeous blooms will add color and visual interest to any landscape! ",
    "PlantType": "Annuals",
    "Color": "The flowers vary in color from a true blue to a definite purple.",
    "HardinessZones": "2-11",
    "BloomsIn": "Spring, Winter",
    "Height": "Nemophila is a small plant, rarely growing over 30 cm (1 ft) high.",
    "SoilNeeds": "The plant likes rich, moist and well drained soil. It prefers soil with a pH of 5.5 to 8.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Nepeta (Catmint; Catnip; Cataria)",
    "Image": "/Flowers/Nepeta.jpg",
    "Desc": " Nepeta, commonly known as Catmint, is a genus of  about 250 species  of flowering plants, native to Europe, Asia and Africa. Nepeta belongs to the  Lamiaceae family , known for its aromatic members. \nThese long-lived, extremely versatile and easy-to-grow perennials make a great addition to your garden. Their aromatic, gray-green leaves and beautiful flowers look great in borders and rock gardens. Because of its self-sufficiency and lack of problems, Nepeta is a good choice for beginner gardeners. ",
    "PlantType": "Perennials",
    "Color": "Nepeta comes in shades of blue, purple, white and even pink and yellow.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Nepeta grows between 20 cm and 2 metres (8 inches to 7 ft) high, depending on variety.",
    "SoilNeeds": "Nepeta prefers moist and well drained soil, with a pH level between 5.5 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Nerine (Guernsey Lily)",
    "Image": "/Flowers/Nerine.jpg",
    "Desc": " Nerine is a genus of  about 25 species  of perennials in the  family Amaryllidaceae , native to South Africa. \nNerine produces showy, lily-like flowers on long stems. These long-lasting flowers have beautiful curled petals in bright colors and will bloom from summer to fall. They are great for beds, rock gardens, borders and containers. ",
    "PlantType": "Bulbs, Perennials",
    "Color": "The flowers come in shades of pink, orange, red and white.",
    "HardinessZones": "8-11",
    "BloomsIn": "Autumn, Summer",
    "Height": "Nerine reaches 60 cm (2 ft) in height.",
    "SoilNeeds": "Nerine likes moist and well drained soil. It is not particular as to soil type or pH.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Nerium (Oleander)",
    "Image": "/Flowers/Nerium.jpg",
    "Desc": " Nerium is a genus of one species –  Nerium oleander  that is native to Europe and Asia. The plant belongs to the  family Apocynaceae  (the dogbane family), one of the largest plant families. \nOleander is an evergreen ornamental shrub or small tree with long, narrow, dark green leaves and brightly colored, five-petaled flowers. The flowers are either single or double and are often gathered in clusters. Oleander is a great garden plant because it is a long-term survivor and grows in a wide array of conditions. It is often planted for decorative purposes and many cultivars are widely available. ",
    "PlantType": "Shrubs, Trees",
    "Color": "The flowers come in shades of red, purple, pink, yellow, cream and white.",
    "HardinessZones": "8-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "This plant can grow up to 6 meters (20 ft) high.",
    "SoilNeeds": "Oleander will grow in almost any soil and can tolerate drought and high salt content in soil. The ideal soil pH is between 6.5 and 7.5.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Nigella (Love-in-a-mist; Devil-in-a-bush)",
    "Image": "/Flowers/Nigella.jpg",
    "Desc": " Nigella is a genus of  about 20 species  in the  family Ranunculaceae , native to Europe, North Africa and Asia. \nThe plant has beautiful, showy flowers surrounded by unusual, thread-like leaves. These attractive, charming and old-fashioned annuals will enchant you immediately! ",
    "PlantType": "Annuals",
    "Color": "The flowers are blue, white and even yellow and pink.",
    "HardinessZones": "2-10",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Nigella grows between 20 cm (8 inches) and 90 cm (3 ft) in height.",
    "SoilNeeds": "The plant prefers good drainage and average soil with a pH value between 6.0 to 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Obregonia (Artichoke Cactus)",
    "Image": "/Flowers/Obregonia.jpg",
    "Desc": " Obregonia is a genus of only  one species – Obregonia denegrii . Obregonia belongs to the  Cactaceae family  and is one of the rarest of living rock cactus. This slow-growing plant, native to northeast Mexico, occurs at an altitude of about 800 meters (2625 ft) above sea level. \nThe plant has solitary stem with large triangular tubercles in the shape of a rosette. It produces funnel-shaped, white or slightly pink flowers, with yellow stamens in the centre. Obregonia is among the most famous of all cacti and will definitely add sunshine and love to your home! ",
    "PlantType": "Cactus - Succulents",
    "Color": "The flower colors are usually white or slightly pink, with yellow stamens.",
    "HardinessZones": "9-12",
    "BloomsIn": "Summer",
    "Height": "Obregonia is a small-sized plant, about 15 cm (6 inches) in height.",
    "SoilNeeds": "Obregonia performs best in well-drained soil with little organic material and neutral pH.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "medium"
  },
  {
    "Name": "Oenothera (Oenothera)",
    "Image": "/Flowers/Oenothera.jpg",
    "Desc": " Oenothera is a genus of  about 100 species  of herbaceous plants in the  family Onagraceae , native to the Western Hemisphere. \nOenothera has simple or lobed leaves and fragrant, bowl-shaped flowers. It has four petals, four sepals and eight stamens. Oenotheras are versatile and can be used in a variety of landscape settings! ",
    "PlantType": "Annuals, Perennials",
    "Color": "Oenothera produces yellow, pink and white flowers.",
    "HardinessZones": "3-7",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The species vary in size from 15 cm to 2,5 metres (6 inches to 8 ft) high.",
    "SoilNeeds": "Oenothera prefers well-drained soil and will do well in poor soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Opuntia (Prickly Pear)",
    "Image": "/Flowers/Opuntia.jpg",
    "Desc": " Opuntia is a genus of  about 200 species  in the  cactus family (Cactaceae) , native to North and South America, from Canada to Argentina. \nOpuntias have a unique shape and structure. The green segments are not leaves, but swollen water-storing stem segments – cladodes. The flat surfaces of these cladodes are covered with areoles that have tiny spines called glochids. Evolutionarily speaking, the leaves are modified into spines to protect a plant against predators. The flowers are usually cup-shaped and yellow in color. Opuntias are attractive, easy to grow and excellent for any garden. They are one of the most beautiful plants in the cactus world! ",
    "PlantType": "Cactus - Succulents",
    "Color": "These flowers are usually yellow, sometimes red and pink, but rarely white.",
    "HardinessZones": "6-11",
    "BloomsIn": "Spring, Summer",
    "Height": "Opuntias vary in height from 20 cm (8 inches) to giants that grow up to 4,5 metres (15 ft) in height.",
    "SoilNeeds": "Opuntia needs well-drained soil that is acid, alkaline or neutral.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Ornithogalum (Star of Bethlehem)",
    "Image": "/Flowers/Ornithogalum.jpg",
    "Desc": " Ornithogalum, commonly known as Star of Bethlehem, is a genus of  more than 150 species  of bulbous perennials in the  family Asparagaceae , native to Europe, Asia and southern Africa. \nOrnithogalum blooms in spring or summer and features multiple star-shaped or cup-shaped blooms that rise on long, brilliant green stems above the semi-erect, grass-like foliage. These plants will grow well in light shade or full sun if they get enough water. Plant them in containers, borders, wild gardens, rock gardens or open woodlands, and they will surprise you with their amazing beauty and charm. Plus, they are one of the longest-lasting cut flowers around! ",
    "PlantType": "Bulbs, Perennials",
    "Color": "The flowers come in white, yellow and orange colors.",
    "HardinessZones": "4-10",
    "BloomsIn": "Spring, Summer",
    "Height": "The plant can grow between 10 and 60 cm (4 inches to 2 ft) tall.",
    "SoilNeeds": "Ornithogalum prefers moist, but well-drained soil. You can grow it in any sandy or loamy soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Osteospermum (African Daisy)",
    "Image": "/Flowers/Osteospermum.jpg",
    "Desc": " Osteospermum is a genus of  about 50 species  of annuals, perennials and sub-shrubs in the  family Asteraceae . \nOsteospermum has beautiful daisy-like flowers in a variety of colors. Like other members of the Asteraceae family, the blooms are actually flower heads composed of a central disc which contains a number of tiny individual flowers known as florets. Most of the species have flat petals, although there are some lovely varieties with spoon-shaped petals. Osteospermums are easy to maintain and will provide an abundance of color for many months. ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "The flowers come in numerous colors and shades including blue, purple, mauve, pink, yellow, white and cream.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Osteospermum reaches up to 60 cm (2 ft) in height.",
    "SoilNeeds": "These sun-loving plants prefer well-drained soil of average fertility. They do not appear to be fussy about soil pH.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Oxalis (Wood Sorrel)",
    "Image": "/Flowers/Oxalis.jpg",
    "Desc": " Oxalis is a genus of  about 500 species  of annuals and perennials in the  family Oxalidaceae , mostly native to South America and Africa. \nThese low-growing plants have brightly colored, funnel-shaped or bowl-shaped flowers, and clover-like leaves which close up at night and open during the day. The flowers are a rich source of nectar which attracts bees, butterflies and flies. Oxalis is cultivated in ornamental purposes and as a source of food. ",
    "PlantType": "Annuals, Bulbs, Perennials",
    "Color": "The flowers come in shades of yellow, pink, white and purple.",
    "HardinessZones": "4-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "This plant reaches 7 to 30 cm (3 to 12 inches) in height.",
    "SoilNeeds": "Oxalis prefers moist and well drained soil, but does not like to be in a soggy spot. They have no special soil requirements.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Paeonia (Peony)",
    "Image": "/Flowers/Paeonia.jpg",
    "Desc": " Paeonia, commonly known as Peony, is a genus of  about 30 species  of perennials and deciduous shrubs or subshrubs in the family  Paeoniaceae , native to Asia, Southern Europe and North America. \nPeonies produce large, showy flowers in a variety of colors. They are famous for they exquisite and often fragrant flowers, which bloom in late spring and early summer. If cared for properly, Peonies can bloom for over 100 years! ",
    "PlantType": "Perennials, Shrubs",
    "Color": "Peonies produce red, pink, purple, white and yellow flowers.",
    "HardinessZones": "2-9",
    "BloomsIn": "Spring, Summer",
    "Height": "The species range in size from 60 cm to 120 cm (2 to 4 ft) tall. However, Peony trees can grow to 3 metres (10 ft) in height.",
    "SoilNeeds": "The plant likes moist and well drained soil, with a ph level from 6.0 to 7.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Papaver (Poppy)",
    "Image": "/Flowers/Papaver.jpg",
    "Desc": " Papaver, commonly known as Poppy, is a genus of  about 50 species  of flowering plants in the  family Papaveraceae , native to Eurasia, Africa and North America. \nThese plants have gray-green leaves and colorful, cup-shaped or saucer-shaped flowers. They are one of the most popular wildflowers and one of the world’s most loved plants. Poppies are pleasing to the eye and attract many beneficial insects. They grow in wild, especially in fields and meadows. However, you can use them in flower beds and gardens. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers bloom in a range of colors, from white, yellow, pink and orange to red and purple.",
    "HardinessZones": "3-10",
    "BloomsIn": "Spring, Summer",
    "Height": "Poppy usually grows between 30 and 90 cm (1-3 ft) tall.",
    "SoilNeeds": "The plant likes well drained soil that is acidic, neutral or alkaline. It tolerates poor soil and drought.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Passiflora (Passion Flower; Passion Vine)",
    "Image": "/Flowers/Passiflora.jpg",
    "Desc": " Passiflora is a large genus of  more than 500 species  of vines, shrubs and trees, in the  family Passifloraceae . The vast majority are found in Central and South America. \nThe species range in size from dwarf to tall, and come in a wide variety of lovely colors. The unusual flowers have complex and unique structures, from a shallow saucer shape to a long cylindrical or trumpet-shaped tube. Passiflora, also known as Passion Flower, is so exotic and different from any other flower you may have seen! ",
    "PlantType": "Annuals, Climbers, Perennials, Shrubs, Trees",
    "Color": "Though a wide range of colors exist, the most common are white, purple and blue.",
    "HardinessZones": "6-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "These plants range in size from 60 cm (2 ft) to 20 metres (65 ft), depending on variety.",
    "SoilNeeds": "Passiflora likes soil that is fertile, moist and well drained. Soil pH can be anywhere between 6.0 to 7.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Pelargonium (Geranium)",
    "Image": "/Flowers/Pelargonium.jpg",
    "Desc": " Pelargonium, commonly known as Geranium, is a genus of  about 250 species , as well as many hybrids and cultivars. The genus belongs to the  family Geraniaceae  and is native to South Africa, Australia and the Middle East. The genus includes annuals and perennials, shrubs and subshrubs, succulents, and both evergreen and deciduous species. \nPelargoniums come in a variety of sizes, shapes and colors. They are prized for their versatility and colorful flowers which are often bi-colored with decorative stripes. They are great for containers, baskets or trailing down over balconies. ",
    "PlantType": "Annuals, Cactus - Succulents, Perennials, Shrubs",
    "Color": "The flowers come in shades of red, purple, orange, pink and white, with many bicolored combinations.",
    "HardinessZones": "8-12",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Pelargoniums grow from 30 to 180 cm (1 to 6 ft) tall.",
    "SoilNeeds": "Pelargoniums prefer fertile, moist and well-drained soil. They are not particular about soil pH, but will do best in a soil that is neutral to slightly acidic.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Penstemon (Beardtongue)",
    "Image": "/Flowers/Penstemon.jpg",
    "Desc": " Penstemon, also known as Beardtongue, is a genus of  more than 200 species  in the  family Plantaginaceae , native to North America. \nPenstemon produces attractive spikes of tubular or funnel-shaped flowers. The bright, nectar-rich flowers are usually showy and five-petalled. Penstemons are attractive in the garden and have a long season of bloom. They will attract bees, butterflies, moths, flies and hummingbirds to your garden! ",
    "PlantType": "Perennials",
    "Color": "Penstemon flowers come in shades of white, yellow, blue, red and purple.",
    "HardinessZones": "3-10",
    "BloomsIn": "Autumn, Summer",
    "Height": "This plant grows between 30 cm (1 ft) and 120 cm (4 ft) high, depending on species.",
    "SoilNeeds": "Most Penstemons require moist and well-drained soil. They usually grow on poor, rocky or sandy soils. This plant does not seem to be fussy about the soil pH, but prefers soil with a pH from 5.5 to 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Perovskia (Perovskia)",
    "Image": "/Flowers/Perovskia.jpg",
    "Desc": " Perovskia is a genus in the  family Lamiaceae , native to southwestern and central Asia. The genus consists of  about 10 species  of perennials and sub-shrubs. \nPerovskia produces showy spikes of tiny tubular flowers that bloom in summer and autumn. The foliage is fragrant and produces an aromatic sage-like scent. Perovskia is a beautiful plant and is easy to care for. ",
    "PlantType": "Perennials, Shrubs",
    "Color": "The flowers come in shades of purple and blue.",
    "HardinessZones": "4-9",
    "BloomsIn": "Autumn, Summer",
    "Height": "Perovskia grows up to 150 cm (5 ft) tall.",
    "SoilNeeds": "This plant does not need a rich soil to grow well, but good drainage is needed. Perovskia thrives in dry soil and requires little water once established. It tolerates a wide range of soil ph.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Petunia (Petunia)",
    "Image": "/Flowers/Petunia.jpg",
    "Desc": " Petunia is a genus of  about 20 species  in the  family Solanaceae , native to South America. \nThis easy to grow plant produces showy, funnel-shaped, single or double flowers that are sweetly perfumed. Petunia is one of the most popular garden plants, with significant ornamental importance. It is perfect for summer flower beds and window boxes. Today, most Petunias are hybrids that are mixes of Petunia and some other flowers. ",
    "PlantType": "Annuals, Perennials",
    "Color": "Petunias are available in almost all colors except for true blue. The most common colors are white, yellow, pink, red and purple.",
    "HardinessZones": "8-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The species range in size from 15 cm to 120 cm (6 inches to 4 ft) in height.",
    "SoilNeeds": "Petunia prefers fertile, moist, but well drained soil, with a pH between 6.0 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Phacelia (Scorpionweed)",
    "Image": "/Flowers/Phacelia.jpg",
    "Desc": " Phacelia is a genus of  about 60 species  in the  family Boraginaceae , native to North and South America. \nThey develop purple or blue flowers arranged in short clusters or fascicles. Phacelia is versatile and will adapt to a variety of soil conditions as long as it remains well drained. Its eye catching flowers are highly attractive to honeybees and bumblebees. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers are most commonly seen in shades of purple and blue.",
    "HardinessZones": "2-10",
    "BloomsIn": "Spring, Summer",
    "Height": "Phacelia can grow up to 120 cm (4 ft) high.",
    "SoilNeeds": "Phacelia prefers well drained soils within a pH range of 6.5 to 8.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Phlox (Phlox)",
    "Image": "/Flowers/Phlox.jpg",
    "Desc": " Phlox is a genus of about 70 species of annuals and perennials in the family Polemoniaceae, mostly native to North America. \nThis plant has thick, strong stems, lance-shaped leaves and clusters of small, star-shaped flowers. The flowers have five petals that come in a wide range of colors. \nThey are hardy and easy to grow in a variety of conditions. ",
    "PlantType": "Annuals, Perennials",
    "Color": "There are many different color varieties available, such as white, yellow, pink, purple, red, lavender, rose, magenta.",
    "HardinessZones": "2-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Phlox can be found in different sizes, from dwarf species only around 10 cm (4 inches) in height to some reaching 120 cm (4 ft) tall.",
    "SoilNeeds": "Phlox prefers moist, but well drained soil, with a pH level between 5.0 and 6.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Platycodon (Balloon Flower; Chinese Bellflower; Japanese Bellflower)",
    "Image": "/Flowers/Platycodon.jpg",
    "Desc": "  Platycodon grandiflorus , the sole species in the genus Platycodon, is a herbaceous perennial in the  family Campanulaceae , native to East Asia. \nIt is also known as the “Balloon Flower”, due to its balloon-like buds that burst open into large and beautiful blossoms. When fully opened, the flower closely resembles a star. It has a simple, but pretty blossom with five pointed petals that surround a star-like pistil. It attracts butterflies and is a magnet for birds. ",
    "PlantType": "Perennials",
    "Color": "Platycodon come in purple, blue, pink and white.",
    "HardinessZones": "3-8",
    "BloomsIn": "Autumn, Summer",
    "Height": "The plant can grow nearly 60 cm (2 feet) tall.",
    "SoilNeeds": "Platycodon will grow in any good well-drained soil, but prefers sandy soil. It will do best in a slightly acidic soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Plumbago (Plumbago)",
    "Image": "/Flowers/Plumbago.jpg",
    "Desc": " Plumbago is a genus of  about 10 species  of annuals, perennials, shrubs and climbers in the  family Plumbaginaceae , occurring in warm temperate and tropical regions worldwide. \nThey are prized for their soft green foliage and clusters of five-petalled saucer-shaped flowers that bloom over a long season. The flowers are so delicate that the plant attracts the admiration of all lovers of the beautiful. These beauties are sun lovers, but will tolerate partial shade. They can be grown in containers, but also as a groundcover or in beds and borders. ",
    "PlantType": "Annuals, Climbers, Perennials, Shrubs",
    "Color": "The flowers come in a variety of colors, but the most common are blue and white.",
    "HardinessZones": "8-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The plants can reach up to 3 m (10 ft) in height, although they are typically smaller.",
    "SoilNeeds": "These plants prefer fertile and well-drained soils. They are drought tolerant and are not fussy about the soil's pH level.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Plumeria (Frangipani; Hawaiian Lei Flower)",
    "Image": "/Flowers/Plumeria.jpg",
    "Desc": " Plumeria, also known as Frangipani, is a genus of  about 300 species  of flowering tropical plants, native to Central America, Mexico, South America, and the Caribbean. Plumeria species belong to the  Apocynaceae family , commonly called the dogbane family. They are popular ornamental plants that can be grown as shrubs or small trees. \nPlumeria is a fast growing plant that produces masses of blossoms that bloom from spring until early fall. It is popular for its fragrant, large flowers and beautiful assortment of colors. Once planted, you will definitely love to watch your Plumeria plant grow! ",
    "PlantType": "Shrubs, Trees",
    "Color": "These flowers can be found in shades of white, yellow, pink and red.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Their sizes vary depending on the variety. Some species can grow up to 10 metres (32 ft) in height, but dwarf varieties are also available.",
    "SoilNeeds": "Plumeria prefers moist, but well drained soil that is slightly acidic.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Polygonatum (Solomon's Seal)",
    "Image": "/Flowers/Polygonatum.jpg",
    "Desc": " Polygonatum is a genus of  about 70 species  of flowering plants in the  family Asparagaceae , distributed across the temperate regions of the Northern Hemisphere. \nThese shade-loving plants produce small, tubular flowers during spring and summer, followed by berries which turn dark blue in late summer. The flowers are pendulous and dangle from slender, arching stems. These are the plants that will add structure, motion and interest to woodland gardens or shady borders. In addition, the gorgeous berries will attract wildlife to your garden, such as hummingbirds and other feathered friends. ",
    "PlantType": "Perennials",
    "Color": "The flowers come in white, green or pink, in solid colors or in combinations.",
    "HardinessZones": "3-8",
    "BloomsIn": "Spring, Summer",
    "Height": "These plants vary in height from 60 to 200 cm (2 to 7 ft), depending on species.",
    "SoilNeeds": "This plant prefers fertile, moist and well-drained soil. It is not fussy about soil pH,",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Potentilla (Cinquefoil)",
    "Image": "/Flowers/Potentilla.jpg",
    "Desc": " Potentilla, widely known as Cinquefoil, is a genus of about  300 species  of flowering plants  in the rose family (Rosaceae) , native to the Northern Hemisphere. \nMany species have palmate leaves with five leaflets, and delicate five-petaled flowers. These plants are valued for their long bloom time, exceptional hardiness and adaptability. They are attractive to birds, bees, butterflies and pollinating insects, and reasonably tolerant of heat and drought. They are outstanding additions to beds and borders, rock gardens, cottage gardens or as groundcovers. ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "The flowers are usually yellow, but can also be white, purple, pink or red.",
    "HardinessZones": "2-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Cinquefoil range in height from 30 to 120 cm (1 to 4 ft), depending on the varieties.",
    "SoilNeeds": "It will thrive in almost any soil, though it prefers reasonably well-drained and moderately fertile soil. The soil pH should be between 5.0 and 7.0",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Primula (Primrose)",
    "Image": "/Flowers/Primula.jpg",
    "Desc": " Primula is a genus of  more than 400 species  of herbaceous perennials in the  family Primulaceae , widely distributed throughout the world. \nThese early bloomers come in a variety of sizes, shapes and colors. They are one of the most popular ornamental plants. With their showy, bright, vibrant flowers that come in array of colors, Primulas are ideal for front borders, beds, edging, paths and walkways, shade gardens and rock gardens. ",
    "PlantType": "Perennials",
    "Color": "These flowers come in a wide range of colors, from blue, purple, green and orange to pink, red, yellow and white.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring",
    "Height": "The species grows up to 60 cm (2 ft) in height.",
    "SoilNeeds": "Primulas prefer moist, but well drained soil and grow best in neutral or slightly acidic soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Protea (Protea)",
    "Image": "/Flowers/Protea.jpg",
    "Desc": " Protea is a genus of  about 50 species  of shrubs and trees in the  family Proteaceae . They grow in regions of the southern hemisphere where conditions are particularly dry. \nThese plants have leathery leaves and clusters of long, narrow, tubular flowers. Those beautiful “petals” are actually colorful bracts (modified leaves), surrounding a central mass of small, tubular flowers. Proteas are large, exotic and fascinating. They appear in a wide variety of shapes, sizes and colors, and are considered one of the oldest flowers in the world! ",
    "PlantType": "Shrubs, Trees",
    "Color": "The flowers come in shades of white, purple, red, orange, yellow and green.",
    "HardinessZones": "8-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "Protea range in height from tiny shrubs to tall trees of 10 meters (33 ft).",
    "SoilNeeds": "The majority of species prefer well drained, sandy and slightly acidic soil (pH 5.5 to 7.0).",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Prunus (Prunus)",
    "Image": "/Flowers/Prunus.jpg",
    "Desc": " Prunus is a large genus of  more than 400 species  of flowering trees and shrubs in the  family Rosaceae , spread throughout the Northern hemisphere. \nMost species in this genus have simple, usually toothed leaves and beautiful five-petaled flowers in various colors. Prunus species can offer not only a beautiful flowers, but also drupes as fruits, known as stone fruits. The genus contains many fruit tree species of global economic importance. They are mostly deciduous trees known by their common names such as: plum trees, cherry trees, peach trees, apricot trees, almond trees, and collectively as the stone fruit trees. ",
    "PlantType": "Shrubs, Trees",
    "Color": "Prunus flowers comes in shades of white, pink, purple and red.",
    "HardinessZones": "2-9",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The species range in height from 1,5 metres to 12 metres (5 to 40 ft) tall.",
    "SoilNeeds": "Prunus likes moist and well drained soil that is acidic, neutral or alkaline.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Pulmonaria (Lungwort)",
    "Image": "/Flowers/Pulmonaria.jpg",
    "Desc": " Pulmonaria is a genus of  about 15 species  of perennials in the  family Boraginaceae , native to Europe and Asia. \nThese shade-loving plants produce hairy leaves in varying shades of green and small funnel-shaped flowers in a variety of colors. They bloom in late winter or early spring, bringing a bright spot of color to our gardens. ",
    "PlantType": "Perennials",
    "Color": "The flowers come in shades of blue, purple, pink and white.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Winter",
    "Height": "Pulmonaria can grow up to 30 cm (1 ft) tall.",
    "SoilNeeds": "Pulmonaria likes moist and well drained soil. Most of the species thrive best in soil with a pH in the 7.0 to 7.5 range.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Quesnelia (Quesnelia)",
    "Image": "/Flowers/Quesnelia.jpg",
    "Desc": " Quesnelia is a genus of  about 20 species  of flowering plants in the  family Bromeliaceae , endemic to eastern and southeastern Brazil. \nThese plants form stiff, upright rosettes of solid green leaves. The flowers are cone-shaped and bloom primarily in winter. They are easy to grow and require very little maintenance. They are drought tolerant once established and cold tolerant. ",
    "PlantType": "Cactus - Succulents, Perennials",
    "Color": "The flowers come in red, blue, pink and yellow colors.",
    "HardinessZones": "9-12",
    "BloomsIn": "Spring, Winter",
    "Height": "These plants can grow up to 60 cm (2 ft) in height.",
    "SoilNeeds": "Quesnelia prefers moist and well drained soil. It is not fussy about soil pH.",
    "SunNeeds": "Full sun, Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Rafflesia (Rafflesia)",
    "Image": "/Flowers/Rafflesia.jpg",
    "Desc": " Rafflesia is a genus of  about 20 species  of parasitic flowering plants in the  family Rafflesiaceae , native to tropical rain forest area of Southeast Asia. \nRafflesia is one of the biggest and one of the stinkiest flower in the world. The flower has five huge leathery petals with a central disc in the middle surrounded by a diaphragm. The plant is bizarre, spectacular and rare, with no leaves, no roots and no stem. It doesn’t have chlorophyll and therefore is incapable of photosynthesis, causing some to argue that the plant isn’t a flower at all. ",
    "PlantType": "",
    "Color": "Rafflesia is reddish brown with white marks on its petals.",
    "HardinessZones": 13,
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "Rafflesia can reach up to 1 m (more than 3 ft) in diameter.",
    "SoilNeeds": "Rafflesia is a parasitic plant and depends completely upon its host, so it doesn't need any soil. Anyway, it has no roots, leaves or stem.",
    "SunNeeds": "Full sun, Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Ranunculus (Buttercup; Crowfoot; Spearwort)",
    "Image": "/Flowers/Ranunculus.jpg",
    "Desc": " Ranunculus is a large genus of  more than 500 species  of flowering plants in the  family Ranunculaceae , native to Europe, Asia and northwest Africa. \nThe species are mostly herbaceous perennials distributed all around the world. If carefully tended, these plants will produce beautiful, showy and bright flowers with five or more petals and numerous pistils and stamens. These long lasting flowers are great for cutting and vase displays. ",
    "PlantType": "Annuals, Bulbs, Perennials",
    "Color": "The flowers are usually yellow, but may also be white, pink and red.",
    "HardinessZones": "7-11",
    "BloomsIn": "Spring, Summer",
    "Height": "Ranunculus can reach a height of between 20 and 60 cm (8 inches to 2 ft), depending on species.",
    "SoilNeeds": "The plant prefers moist and well drained soil. The pH level of the soil should be slightly acidic.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Rhododendron (Rhododendron)",
    "Image": "/Flowers/Rhododendron.jpg",
    "Desc": " Rhododendron is a genus of  about 1000 species  of shrubs and small trees in the  Ericaceae family , native to Asia, Europe, North America and Northern Australia. \nRhododendrons come in various shapes, sizes and bloom times. They are wonderful garden plants grown for their bell-shaped flowers and attractive evergreen foliage. The flowers are colorful, showy and sometimes fragrant. ",
    "PlantType": "Shrubs, Trees",
    "Color": "Rhododendron blooms in various colors, from pure white to red, orange and pink to gold and purple.",
    "HardinessZones": "3-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The species range in size from low ground covers and medium sized shrubs to trees that can reach 25 metres (82 ft) tall.",
    "SoilNeeds": "Rhododendrons will perform best in moist and well drained soil, with a pH level between 4.5 and 6.0.",
    "SunNeeds": "Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Rondeletia (Rondeletia)",
    "Image": "/Flowers/Rondeletia.jpg",
    "Desc": " Rondeletia is a genus of  about 150 species  of tropical trees and shrubs in the  family Rubiaceae , native to Central America. \nThe plant has glossy, evergreen leaves and small, fragrant flowers that grow in clusters. The flowers have four or five petals and will attract birds and butterflies to your garden. ",
    "PlantType": "Shrubs, Trees",
    "Color": "The flowers are white, yellow, pink and red, sometimes with yellow centers.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The plant can grow up to 4,5 metres (15 ft) tall.",
    "SoilNeeds": "Rondeletia will grow best in rich, moist and well drained soil that is slightly acidic.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Rosa (Rose)",
    "Image": "/Flowers/Rosa.jpg",
    "Desc": " Rosa, commonly known as Rose, is a genus of  about 150 species  of deciduous or semi-evergreen perennials in the  family Rosaceae , native to the regions of the Northern Hemisphere. \nRoses are one of the most popular flowers in the world prized for its beauty, as well as its many useful qualities. They are famous for their strong fragrance and attractive multi-petalled flowers surrounded by the strong and sharp thorns of the Rose bush. Flowers vary in size and shape and are often followed by red or purple fruits known as “Rose hips”. Roses are great for any floral occasion. They are present and they are everywhere where love blooms! ",
    "PlantType": "Climbers, Roses, Shrubs",
    "Color": "Roses range in color from white and yellow to red, pink and purple.",
    "HardinessZones": "2-10",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Roses range in size from dwarf species to climbers that can reach 12 metres (40 ft) in height.",
    "SoilNeeds": "This plant grows best in moist and well drained soil, with a pH level between 5.5 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Rudbeckia (Coneflower)",
    "Image": "/Flowers/Rudbeckia.jpg",
    "Desc": " Rudbeckia is a genus of  about 25 species  of flowering plants, usually perennials, but also annuals and biennials in the  family Asteraceae , native to woodlands and meadows of North America. \nRudbeckias are characterised by their colorful daisy-shaped flowers with central cones. They are always a great choice for the late summer border! ",
    "PlantType": "Annuals, Perennials",
    "Color": "Rudbeckias are mostly yellow, but also can be red and orange, with central cones that can be green, black and brown.",
    "HardinessZones": "3-9",
    "BloomsIn": "Autumn, Summer",
    "Height": "This plant grows between 30 and 120 cm (1 to 4 ft) in height.",
    "SoilNeeds": "Rudbeckia likes moist and well drained soil that is neutral, alkaline or acidic.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Salvia (Sage)",
    "Image": "/Flowers/Salvia.jpg",
    "Desc": " Salvia is a genus of  about 1000 species  of annual or perennial herbs and shrubs, distributed throughout the world from Central and South America to Central Asia and Mediterranean Europe. It is the largest genus of plants in the  family Lamiaceae . \nSalvia, commonly known as Sage, has slender, tubular-shaped and nectar-rich flowers and often aromatic leaves. It is perfect for beds, borders and containers and is great for bringing butterflies and hummingbirds to your garden. ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "Salvia blooms in a range of colors, from traditional dark blue to light blue, red, pink, and white.",
    "HardinessZones": "3-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "Salvia grows from 30 cm to 180 cm (1 to 6 ft) tall, depending on species.",
    "SoilNeeds": "Salvia grows best in moist, but well-drained soil, with a pH level between 6.0 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Sandersonia (Christmas Bells; Chinese Lantern Lily)",
    "Image": "/Flowers/Sandersonia.jpg",
    "Desc": " Sandersonia is a genus in the  family Colchicaceae , with a  single species – Sandersonia aurantiaca . \nThis plant has lance-shaped leaves and delicate lantern-like flowers borne on long stalks. It grows up to 90 cm (3 ft) tall and usually has climbing habit. The flowers are orange or yellow and are prized as cut flowers because they last long. ",
    "PlantType": "Climbers, Perennials",
    "Color": "The flowers are orange or yellow.",
    "HardinessZones": "8-11",
    "BloomsIn": "Spring, Summer",
    "Height": "This plant grows up to 90 cm (3 ft) in height.",
    "SoilNeeds": "Sandersonia aurantiaca prefers sandy or loamy soil that is moist, well drained and slightly acidic.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Saxifraga (Saxifrage; Rockfoil)",
    "Image": "/Flowers/Saxifraga.jpg",
    "Desc": " Saxifraga, commonly called Saxifrage or Rockfoil, is a large genus of  about 400 species  of perennials in the  family Saxifragaceae , native to temperate, subarctic and alpine areas of Europe, Asia and North America. \nThis plant produces fine-textured foliage and small bright flowers, usually with five petals, five sepals and ten stamens. Saxifrages are great for rock gardens, containers or along retaining walls. ",
    "PlantType": "Perennials",
    "Color": "The flowers are usually white, but may be yellow, purple, pink and red.",
    "HardinessZones": "3-10",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "This plant usually reaches about 30 cm (1 ft) in height.",
    "SoilNeeds": "Appropriate soil type depends on species. In general, these plants like moist and well-drained soil, with a pH level between 6.0 and 8.0.",
    "SunNeeds": "Full sun, Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Scabiosa (Scabious; Pincushion Flower)",
    "Image": "/Flowers/Scabiosa.jpg",
    "Desc": " Scabiosa is a genus of  about 70 species  of flowering plants in the  family Caprifoliaceae , native to Africa, Europe and Asia. \nThe genus includes both annuals and perennials, and all of these varieties are easy to grow and available in a variety of shapes and colors. Each flower is composed of many individual flowers called florets, which are crowded together. The flowers have long stamens that give them pincushion-like appearance, hence the common name. These gorgeous, nectar-rich flowers are very attractive to butterflies and bees, as well as people. Delicate and full of charm, they make good garden plants. ",
    "PlantType": "Annuals, Perennials",
    "Color": "These flowers come in different colors including blue, purple, white, yellow, pink and red.",
    "HardinessZones": "3-9",
    "BloomsIn": "Autumn, Summer",
    "Height": "Scabiosa typically ranges in height from 15 cm (6 inches) to 60 cm (2 ft).",
    "SoilNeeds": "Scabiosa grows best in rich soil with good drainage and with plenty of sunlight. It can be grown in soils with a pH range from 5.0 to 7.5.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Scilla (Squill)",
    "Image": "/Flowers/Scilla.jpg",
    "Desc": " Scilla is a genus of bulbous perennial herbs with  about 100 species  in the  family Asparagaceae , native mainly to Asia, North Africa and Mediterranean, with a few species coming from Australia and North America. \nScilla is a beautiful, low-growing plant with attractive spiky, star-shaped or bell-shaped flowers. Different species of Scilla thrive in different growing conditions, often planted to produce beautiful blue colored flowers. These flowers are attractive in rock gardens, woodland gardens and meadows. ",
    "PlantType": "Bulbs",
    "Color": "Scilla comes in shades of blue, purple and white. The blue ones are very pretty, some of the best blues to be found among flowers.",
    "HardinessZones": "2-10",
    "BloomsIn": "Spring, Winter",
    "Height": "Scilla can grow up to 60 cm (2 ft) high However, some species are less than 10 cm (4 inches) tall.",
    "SoilNeeds": "Scilla likes rich and well drained soil, with a pH level between 6.0 and 8.0. It will not grow well in waterlogged soils.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Sedum (Stonecrop)",
    "Image": "/Flowers/Sedum.jpg",
    "Desc": " Sedum, commonly known as Stonecrop, is a large genus of succulent plants  in the  Crassulaceae family , distributed through the Northern hemisphere with only a few species native to Southern hemisphere. The genus contains  about 500 species  of annuals, evergreen or deciduous perennials and subshrubs. \nMost species have attractive, fleshy leaves and beautiful, star-shaped flowers. Sedums thrive in rock gardens, around stones or alongside pathways and structures, and come in a variety of colors and forms. ",
    "PlantType": "Annuals, Cactus - Succulents, Perennials, Shrubs",
    "Color": "The flowers come in a rainbow of colors, from red, orange, pink and purple to yellow and white. The foliage can be found in different colors, too.",
    "HardinessZones": "3-10",
    "BloomsIn": "Autumn, Summer",
    "Height": "Sedums can grow from 10 to 90 cm (4 inches to 3 ft), depending on variety.",
    "SoilNeeds": "These plants prefer well drained soil that is neutral, alkaline or acidic. The ideal soil pH is between 6.0 and 8.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Solidago (Goldenrod)",
    "Image": "/Flowers/Solidago.jpg",
    "Desc": " Solidago, also known as Goldenrod, is a genus of  more than 100 species  of flowering plants in the  family Asteraceae . Goldenrods are usually herbaceous perennials native to North America. \nThese sun-loving plants have long and slender stems with spiky tooth-like parts, and tiny golden-yellow flowers that bloom in thick clusters. Solidago could be a good choice for the back of a garden bed. ",
    "PlantType": "Perennials",
    "Color": "Goldenrods come in a bright, golden-yellow color.",
    "HardinessZones": "3-9",
    "BloomsIn": "Autumn, Summer",
    "Height": "Goldenrods can grow up to 90 cm (3 ft) in height, while some species are only 10 cm (4 inches) tall.",
    "SoilNeeds": "Solidago grows best in well drained soil that is acidic to neutral.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Spiraea (Spirea)",
    "Image": "/Flowers/Spiraea.jpg",
    "Desc": " Spiraea, also known as Spirea, is a genus of  more than 100 species  of flowering shrubs in the  family Rosaceae , native to the temperate regions of the Northern Hemisphere. \nThese plants have simple, fine-textured leaves and short racemes, panicles or corymbs of tiny, five-petaled flowers in shades of purple, pink, yellow, cream and white. They are tolerant of some shade, but full sun encourages a profusion of flowers. Spirea deserves a spot in every garden that has room for a small shrub. Once established, this charming garden plant will attract birds and butterflies, making your green space a wildlife heaven. ",
    "PlantType": "Shrubs",
    "Color": "The flowers come in shades of purple, pink, yellow, cream and white.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "These plants can grow up to 3 m (10 ft) in height, depending on species.",
    "SoilNeeds": "The plant grows in almost any type of soil that is well-drained. The ideal soil pH is between 6.0 and 7.0. If soil is too alkaline (above 7.0), it may reduce the plant's ability to take up some nutrients resulting in the yellowing of foliage (chlorosis).",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Strelitzia (Bird of Paradise; Crane Flower)",
    "Image": "/Flowers/Strelitzia.jpg",
    "Desc": " Strelitzia is a genus of  five species  in the  family Strelitziaceae , native to southern Africa. \nWith its vibrant blooms and shape that resembles the head of an exotic bird, Strelitzia is one of the most unusual looking flowers. It produces long-stalked leaves with striking, unique and colorful flowers that makes it look alive, like a brightly colored bird. Strelitzia is one of the most popular tropical flowers that performs well in bouquets and arrangements, adding an often needed tropical flair. ",
    "PlantType": "Perennials, Shrubs",
    "Color": "The flowers are orange, red, yellow or even blue and purple.",
    "HardinessZones": "9-12",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "Strelitzia can grow as tall as 1 m (3 ft) or taller, while some species (Strelitzia nicolai) can reach 10 metres (33 ft) high.",
    "SoilNeeds": "Strelitzia prefers organically rich, moist and well drained soil. The optimal soil pH is between 6.0 and 6.5. If treated well, this plant can produce up to 36 flower spikes a year.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Syringa (Lilac)",
    "Image": "/Flowers/Syringa.jpg",
    "Desc": " Syringa, better known as Lilac, is a genus of  about 20 species  of deciduous shrubs or trees in the  olive family (Oleaceae) , native to Eurasia. \nLilacs are one of the best known spring-flowering plants. They produce incredibly fragrant, tubular flowers which capture the essence of spring. Lilacs come in different shapes, sizes and colors, encouraging everyone to admire them and use them in different ways. ",
    "PlantType": "Shrubs, Trees",
    "Color": "Although they get their common name from their most popular color, Lilacs can also be found in other colors such as blue, red, pink, white and yellow.",
    "HardinessZones": "3-8",
    "BloomsIn": "Spring, Summer",
    "Height": "Lilacs range in size from 2 to 10 metres (7 to 33 ft) high, depending on species.",
    "SoilNeeds": "These plants prefer fertile, moist, but well-drained soil. The ideal soil pH for growing Lilacs is neutral to alkaline.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Tagetes (Marigold)",
    "Image": "/Flowers/Tagetes.jpg",
    "Desc": " Tagetes is a genus of  about 50 species  of annuals and perennials in the  family Asteraceae , native to Central and South America. \nThey come in various shapes and sizes, from dwarf to tall growing, and have colorful flowers that are solitary or clustered. Available in various shapes and sizes, these flowers can be used in beds and borders or in containers, and will grow just about anywhere. Start your flower gardening this year with these beautiful flowers! ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "Tagetes comes in shades of yellow, orange and even white.",
    "HardinessZones": "2-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "These species range in size from 15 to 80 cm (6 inches to 3 ft) tall, rarely until 2 metres (7 ft).",
    "SoilNeeds": "Tagetes grows in almost any soil, but will perform best in moderately fertile, well-drained soil.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Tanacetum (Tanacetum)",
    "Image": "/Flowers/Tanacetum.jpg",
    "Desc": " Tanacetum is a genus of  about 150 species  in the  family Asteraceae , native to many regions of the Northern Hemisphere. \nThey can be annuals, perennials or sub-<wbr/>shrubs, with feathery aromatic leaves and daisy-like or button-like flowers on woody stems. Some species have yellow disk florets and no ray florets, while others have both ray and disk florets, usually in yellow or white. The most popular species is Tanacetum vulgare, commonly known as Tansy. ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "The flowers are usually white or yellow, depending on species.",
    "HardinessZones": "3-9",
    "BloomsIn": "Summer",
    "Height": "These plants can grow from a few inches to 150 cm (5 ft) tall.",
    "SoilNeeds": "Tanacetum prefers moist and well-drained soil, but tolerates a wide variety of soils and pH conditions.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Taraxacum (Dandelion)",
    "Image": "/Flowers/Taraxacum.jpg",
    "Desc": " Taraxacum, widely known as Dandelion, is a large genus of  more than 500 species  of herbaceous perennials in the  Asteraceae family , native to Eurasia. \nDandelions are immensely popular and spread all over the world, growing anywhere there is a pinch of soil. They come in various shapes and sizes, with their yellow flowers blooming all season long. These invasive weeds can occupy a variety of environments, giving them an impressive look and magical appearance! ",
    "PlantType": "Perennials",
    "Color": "The flowers are usually bright yellow, but they can be darker or even white, such as Taraxacum albidum.",
    "HardinessZones": "3-10",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "Dandelions range in height from 5 to 50 cm (2-20 inches) in height.",
    "SoilNeeds": "Although Dandelions adopt most conditions and grow everywhere, they will grow best in moist areas with fertile and well-drained soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Tigridia (Tiger Flower; Mexican Shellflower)",
    "Image": "/Flowers/Tigridia.jpg",
    "Desc": " Tigridia is a genus of  about 35 species  of bulbous plants in the  family Iridaceae , native to subtropical and tropical America. \nThese eye-catching plants have interesting and unusual shape. They produce attractive sword-like leaves and large, showy, three-petaled flowers in a variety of colors. There is no doubt that Tigridia is one of the most spectacular plant in the summer garden! ",
    "PlantType": "Bulbs",
    "Color": "The flowers may be red, yellow, white, cream, orange, scarlet, pink and mauve.",
    "HardinessZones": "8-11",
    "BloomsIn": "Summer",
    "Height": "These plants usually grow between 30 and 60 cm (1-2 ft) tall.",
    "SoilNeeds": "Tigridia performs best in rich and well-drained soil. It is not too fussy when it comes to soil pH.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Torenia (Wishbone Flower; Bluewings; Clown Flower)",
    "Image": "/Flowers/Torenia.jpg",
    "Desc": " Torenia, widely known as Wishbone Flower, is a genus of  about 15 species  in the  family Linderniaceae , native to Africa and Southeast Asia. \nThis charming plant produces oval or heart-shaped leaves and beautiful bright flowers in shades of purple, blue, pink, yellow and white. These unusual, trumpet-like flowers are two-lipped, with prominent markings on their petals. The plant is suitable for use in garden beds and borders, as well as containers. ",
    "PlantType": "Annuals",
    "Color": "The flowers come in shades of purple, blue, pink, yellow and white.",
    "HardinessZones": "2-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Torenia grows up to 30 cm (1 ft) in height.",
    "SoilNeeds": "Torenia prefers rich, loamy, moist and well drained soil. The plant is not particular about soil pH, but it does best in a soil that is slightly acidic.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Tradescantia (Spiderwort)",
    "Image": "/Flowers/Tradescantia.jpg",
    "Desc": " Tradescantia, commonly known as Spiderwort, is a genus of plants in the  family Commelinaceae  comprising  about 70 species  of herbaceous perennials native to the New World. \nMost of the species have long, sword-like leaves and three-petaled flowers with contrasting yellow stamens. The flowers are usually bright blue or purple, but are occasionally pink, red and white. Some species are valued for their variegated leaves, while others showcase beautiful flowers at various times throughout the season. These plants are amongst the easiest plants to grow as long as you understand their needs. They are great for borders, edging, hanging baskets or as groundcovers, and can add a lush texture to any garden. ",
    "PlantType": "Perennials",
    "Color": "The flowers come in shades of blue, purple, pink, red and white.",
    "HardinessZones": "4-12",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "This plant can reach up to 90 cm in height.",
    "SoilNeeds": "Spiderwort prefers fertile, moist and well-drained soil. The soil should be acidic, with a pH range between 5.0 and 6.5.",
    "SunNeeds": "Full sun, Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Tricyrtis (Toad Lily)",
    "Image": "/Flowers/Tricyrtis.jpg",
    "Desc": " Tricyrtis is a genus of  about 20 species  in the  family Liliaceae , native to moist woodlands and high elevations of eastern Asia. \nThese shade-loving perennials produce exotic, orchid-like flowers that bloom in summer and autumn. The flowers have six petals that are covered with hundreds of small purple spots. They are star-shaped or bell-shaped and are often borne on upright, arching stems. ",
    "PlantType": "Perennials",
    "Color": "The flowers come in shades of red, purple, white and yellow.",
    "HardinessZones": "4-9",
    "BloomsIn": "Autumn, Summer",
    "Height": "Tricyrtis reaches up to 90 cm (3 ft) in height.",
    "SoilNeeds": "Tricyrtis prefers rich, moist and well-drained soil, with a pH from acid to neutral. The plant is adaptable and can tolerate heat, cold and humidity.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Trillium (Wake Robins; Birthroot)",
    "Image": "/Flowers/Trillium.jpg",
    "Desc": " Trillium is a genus of  about 50 species  of flowering perennial herbs in the  family Melanthiaceae , native to Asia and North America. \nThis shade-loving plant has three leaves, three petals and three sepals in perfect symmetry. Its unique shape makes it attractive and well recognizable! Trilliums are often fragrant and bloom in spring and summer. They are great in shaded beds and borders, as well as in woodland gardens. ",
    "PlantType": "Perennials",
    "Color": "Flower color varies from red, pink, maroon and purple to yellow and white.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Summer",
    "Height": "Trillium usually grows between 30 and 60 cm (1-2 ft) in height.",
    "SoilNeeds": "Trillium performs best in rich, moist and well-drained soil that is neutral to slightly acidic.",
    "SunNeeds": "Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Trollius (Globe Flower)",
    "Image": "/Flowers/Trollius.jpg",
    "Desc": " Trollius, commonly known as Globe Flower, is a genus of  about 30 species  of mostly herbaceous perennials in the  family Ranunculaceae , native to Europe, Asia and Americas. \nThese plants have finely dissected, dark green foliage and large, buttercup-shaped or ball-shaped flowers atop tall stems. They bloom in spring and summer, producing wonderful and bright flowers. ",
    "PlantType": "Perennials",
    "Color": "These beautiful flowers bloom in shades of yellow, orange and white.",
    "HardinessZones": "3-8",
    "BloomsIn": "Spring, Summer",
    "Height": "Trollius can grow up to 90 cm (3 ft) in height.",
    "SoilNeeds": "Trollius prefers rich, poorly-drained soil and regular moisture. The ideal soil pH is between 5.0. and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Tropaeolum (Nasturtium)",
    "Image": "/Flowers/Tropaeolum.jpg",
    "Desc": " Tropaeolum, also known as Nasturtium, is a genus of  about 70 species  in the  family Tropaeolaceae , native to Central and South America. \nThese plants have flowers that are usually funnel-shaped, five-petaled, bright colored and fragrant. They need little care and are always there to please you with their charming appearance! ",
    "PlantType": "Annuals, Perennials",
    "Color": "Nasturtium comes in red, orange, yellow, purple and cream colors.",
    "HardinessZones": "2-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Nasturtium vary in height from 20 cm (8 inches) to 3 metres (10 ft), depending on species.",
    "SoilNeeds": "The plant is suitable for sandy and loamy soils with a pH between 5.5 and 7.5. It also grows in nutritionally poor soil.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Tulipa (Tulip)",
    "Image": "/Flowers/Tulipa.jpg",
    "Desc": " Tulips belong to the genus Tulipa  in the   lily family (Liliaceae) . There are  around 100 species  and over 3000 different varieties of cultivated Tulips. They grow wild in Central Asia, through Siberia to China. \nTulips are one of the most popular spring flowers and one of the most popular flowers worldwide. They come in many varieties of colors and shapes and are great for pots, borders and as cut flowers. ",
    "PlantType": "Annuals, Bulbs, Perennials",
    "Color": "You will find Tulips in nearly every color and pattern.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring",
    "Height": "Tulips can be short (less than 20 cm or 8 inches), medium (20-45 cm or 8-18 inches) and tall (greater than 45 cm or 18 inches).",
    "SoilNeeds": "These plants prefer fertile, moist, soft and well-drained soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Ulex (Gorse; Furze)",
    "Image": "/Flowers/Ulex.jpg",
    "Desc": " Ulex, also known as Gorse or Furze, is a genus composed of  about 15 species  of evergreen shrubs in the  family Fabaceae , native to western Europe and northwest Africa. \nMost of the species have narrow and thorn-like leaves, with flowers generally being small, pea-shaped and golden yellow. Gorse is in flower through most of the year, hence the saying “<em>When Gorse is out of bloom, kissing is out of season</em>“. ",
    "PlantType": "Shrubs",
    "Color": "The flowers are usually yellow in color.",
    "HardinessZones": "6-10",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "The plant can grow up to 3 metres (10 ft) high.",
    "SoilNeeds": "The plant grows in most soils, but does best in soil that is sandy and slightly acidic. It appreciates hot sun and dry, poor soil.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Ursinia (African Daisy)",
    "Image": "/Flowers/Ursinia.jpg",
    "Desc": " Ursinia is a genus of  about 40 species  of annuals, herbaceous perennials and subshrubs in the  family Asteraceae , native to South Africa. \nUrsinia is popular for its daisy-like, showy flowers that bloom all season long. The flowers attract bees, as well as other beneficial insects. This is one of the easiest plants to grow and is ideal for beginner gardeners. ",
    "PlantType": "Annuals, Perennials",
    "Color": "Ursinia has yellow, red or orange flowers.",
    "HardinessZones": "3-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "Ursinia grows from 20 cm to 60 cm (8 inches to 2 ft) in height.",
    "SoilNeeds": "Ursinia prefers sandy, fertile and well drained soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Valeriana (Valerian)",
    "Image": "/Flowers/Valeriana.jpg",
    "Desc": " Valeriana is a genus of  more than 250 species  of perennial herbs in the  family Caprifoliaceae , native to Europe, Asia, South and North America. \nThe plant produces a tall stem with clusters of sweetly scented white, pink or lavender flowers. The flowers are star-like, tiny and beautiful. Valerian is a highly valued medicinal plant which has a wide impressive range of traditional medical applications. ",
    "PlantType": "Perennials",
    "Color": "The flowers are white, pink or lavender.",
    "HardinessZones": "4-9",
    "BloomsIn": "Autumn, Summer",
    "Height": "The plant can reach 1,5 meters (5 ft) in height.",
    "SoilNeeds": "The plant performs best in fertile, moist and well drained soil, with slightly acidic to neutral pH.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Verbascum (Mullein)",
    "Image": "/Flowers/Verbascum.jpg",
    "Desc": " Verbascum, commonly known as Mullein, is a genus of  more than 100 species  of flowering plants in the  family Scrophulariaceae , native to Europe and Asia. Most of the species are perennials, meaning they will come back year after year without the need to replant. \nMullein is a tall and handsome plant with a spear of rich, saucer-shaped flowers that are usually yellow in color. Leaves are silvery, large and somewhat hairy but soft. This sun-loving plant thrives on dry, stony hillsides and open woodlands, standing proud and upright. ",
    "PlantType": "Annuals, Perennials",
    "Color": "These flowers are primarily bright yellow, but also white, red, purple and pink.",
    "HardinessZones": "5-10",
    "BloomsIn": "Spring, Summer",
    "Height": "Mullein has a flower spike that reaches 3 metres (10 ft) high.",
    "SoilNeeds": "Mullein thrives in well-drained soil that is slightly alkaline.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Verbena (Vervain)",
    "Image": "/Flowers/Verbena.jpg",
    "Desc": " Verbena, also known as Vervain, is a genus of  more than 100 species  in the  family Verbenaceae , native to Asia and America. \nVerbena has beautiful, tiny flowers grouped into rounded clusters. This drought and heat tolerant plant is great for beds, borders, hanging baskets and rock gardens. It is also good for planting in cracks between stones and walls. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The blooms come in shades of purple, red, pink and white.",
    "HardinessZones": "3-12",
    "BloomsIn": "Autumn, Summer",
    "Height": "Verbena grows from 7 cm to 180 cm (3 inches to 6 ft) tall, depending on species.",
    "SoilNeeds": "This plant prefers moist, but well drained soil. It is not particular about soil pH, but it grows best in soil with a pH between 6.0 and 8.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Veronica (Speedwell)",
    "Image": "/Flowers/Veronica.jpg",
    "Desc": " Veronica is a genus of  about 200 species  of herbaceous perennials in the  family Plantaginaceae , mostly native to the Northern Hemisphere with some species from the Southern Hemisphere. \nVeronica has tall spikes covered with showy, tubular or saucer-shaped flowers which bloom from spring to autumn. The flowers are so bright and beautiful, and attractive to many pollinators. ",
    "PlantType": "Perennials",
    "Color": "Veronica comes in shades of blue, purple, pink and white.",
    "HardinessZones": "3-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Veronica comes in a wide range of sizes, from dwarfs that rarely exceed 10 cm (4 inches) to large specimens that can grow more than 1,5 metres (5 ft) in height.",
    "SoilNeeds": "This plant prefers moist, but well-drained soil that is neutral, alkaline or acidic.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Veronicastrum (Veronicastrum)",
    "Image": "/Flowers/Veronicastrum.jpg",
    "Desc": " Veronicastrum is a genus of  about 10 species  of herbaceous perennials in the  family Plantaginaceae , mostly native to North America. \nVeronicastrum produces attractive foliage and clusters of small flowers on erect, tall stems from summer to fall. It’s easy to grow and makes a pretty addition to beds and borders. It will look charming as a part of your garden landscape and will attract bees and butterflies to your garden. ",
    "PlantType": "Perennials",
    "Color": "The flowers come in shades of white, purple and pink.",
    "HardinessZones": "3-9",
    "BloomsIn": "Autumn, Summer",
    "Height": "Veronicastrum reaches nearly 2 m (6 ft) in height.",
    "SoilNeeds": "Veronicastrum prefers fertile, moist and well-drained soil. It tolerates a wide range of soil pH levels.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Vinca (Periwinkle)",
    "Image": "/Flowers/Vinca.jpg",
    "Desc": " Vinca, also known as Periwinkle, is a genus of  6 species  of herbaceous perennials or evergreen shrubs in the  family Apocynaceae , native to Europe, northwest Africa and Middle East. \nThese easy-to-care plants are grown for their glossy, dark green foliage and eye-catching, unique pinwheel-shaped flowers. Vinca is great for beds, borders and as ground cover. ",
    "PlantType": "Perennials, Shrubs",
    "Color": "Vinca comes in shades of pink, purple, red and white.",
    "HardinessZones": "3-11",
    "BloomsIn": "Autumn, Summer",
    "Height": "Vinca range in size from dwarf species that grow only about 10 cm (4 inches) tall to the larger types which can grow up to 60 cm (2 ft) in height.",
    "SoilNeeds": "Vinca prefers moist, but well drained soil and is adaptable to soils of various pHs.",
    "SunNeeds": "Full sun, Partial sun, Shade",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Viola (Violet)",
    "Image": "/Flowers/Viola.jpg",
    "Desc": " Viola is a genus of  over 500 species  in the  family Violaceae . They can be found all over the world, but most of them are in the temperate areas of the northern hemisphere. \nViolas are one of the most popular flowers, well known for their charming fragrant blooms and heart shaped leaves. They are suitable for the front of borders and beds, as well as in containers. ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "As their name suggests, many species are violet in color, but can also be blue, white, yellow and cream. Some blooms have two or even three colors.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "Violas are small plants up to 20 cm (8 inches) tall.",
    "SoilNeeds": "Violas prefer rich, moist and well drained soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Watsonia (Bugle Lily)",
    "Image": "/Flowers/Watsonia.jpg",
    "Desc": " Watsonia is a genus of  about 50 species  of perennials in the  family Iridaceae , native to southern Africa. \nWatsonia produces sword-shaped or lance-shaped leaves and showy spikes of tubular flowers with spreading lobes. \nWith their bright colors and tall flowering spikes, these lovely plants will add a colorful vibrance to any landscape. Give them sunshine and some occasional water and they will pull out a smile from your face every time you see them! ",
    "PlantType": "Bulbs, Perennials",
    "Color": "The flowers come in shades of red, pink, orange, purple and white.",
    "HardinessZones": "8-11",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "This plant grows from 30 cm to 2 metres (1 ft to 7 ft) in height.",
    "SoilNeeds": "Soil should be acidic or neutral and should be moist and well-drained.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Weigela (Weigela)",
    "Image": "/Flowers/Weigela.jpg",
    "Desc": " Weigela is a genus of  about 10 species  of flowering shrubs in the  family Caprifoliaceae , native to open woodlands of eastern Asia. \nThese species have attractive foliage and tubular or trumpet-shaped flowers that bloom in late spring and early summer, but also sporadically throughout the year. They are perfect for anyone who wishes to grow long blooming, flowering shrubs. They bring charm to any garden and never fail to catch the eye of passers-by! ",
    "PlantType": "Shrubs",
    "Color": "The flowers come in shades of red, pink, white and yellow.",
    "HardinessZones": "4-9",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "This plant grows from 30 cm (1 ft) to 3 metres (10 ft) high.",
    "SoilNeeds": "Weigela prefers fertile and moist, but well-drained soil. It can tolerate soil pH levels between 5.5 and 7.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Wisteria (Wisteria)",
    "Image": "/Flowers/Wisteria.jpg",
    "Desc": " Wisteria is a genus of fast-growing, deciduous climbers. It contains  about 10 species  of woody climbing vines in the  family Fabaceae , native to East Asia and the USA. \nThey are ideal for training into trees, covering walls and other garden structures or as a freestanding half standard. Wisterias require high maintenance and usually begin flowering within three to five years of planting. ",
    "PlantType": "Climbers",
    "Color": "Wisteria comes in shades of white, blue, purple and pink.",
    "HardinessZones": "5-9",
    "BloomsIn": "Spring, Summer",
    "Height": "Wisteria grows from 180 cm to 12 metres (6 to 40 ft) tall, depending on species.",
    "SoilNeeds": "Wisteria likes moist, well-drained and fertile soil. It grows best in slightly acidic to neutral soil.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "hard"
  },
  {
    "Name": "Xanthisma (Xanthisma)",
    "Image": "/Flowers/Xanthisma.jpg",
    "Desc": " Xanthisma is a genus of  about 10 species  in the  family Asteraceae , native to the United States and Mexico. \nMost species have bright yellow, daisy-like flowers at the tips of branching stems. These wildflowers bloom mostly in spring, but may flower at other times of the year. They are drought-tolerant and great for xeriscape gardening. ",
    "PlantType": "Annuals, Perennials",
    "Color": "The flowers are generally yellow in color, but there are also varieties that are white and purple.",
    "HardinessZones": "3-9",
    "BloomsIn": "Spring, Autumn, Winter, Summer",
    "Height": "This plant can reach a height of 60 cm (2 ft).",
    "SoilNeeds": "Xanthisma prefers well-drained, sandy soil and can survive in dry soil as well. It tolerates pH levels between 5.0 and 7.0.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Xeranthemum (Xeranthemum)",
    "Image": "/Flowers/Xeranthemum.jpg",
    "Desc": " Xeranthemum is a genus of  6 species  of annuals in the  family Asteraceae , native to the Mediterranean and southwestern Asia. \nThe members of this genus are known for their silvery foliage and colorful, daisy-like, papery flowers. They have alternate, undivided leaves and compact heads of small florets on long stalks. They are great cut flowers and are suited to both formal and modern style arrangements. ",
    "PlantType": "Annuals",
    "Color": "These flowers come in shades of pink, purple and white.",
    "HardinessZones": "2-10",
    "BloomsIn": "Autumn, Summer",
    "Height": "This plant can grow between 30 and 90 cm (1-3 ft) tall.",
    "SoilNeeds": "Xeranthemum prefers fertile, moist and well-drained soil.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Xerochrysum (Xerochrysum)",
    "Image": "/Flowers/Xerochrysum.jpg",
    "Desc": " Xerochrysum is a genus of  8 species  of flowering plants, native to Australia. The genus belongs to the  family Asteraceae , with both annual and perennial varieties. \nXerochrysum produces showy, papery-like bracts in a variety of colors. Tiny, individual flowers are yellow in color and formed into a large cluster surrounded by beautiful bracts. Xerochrysum is attractive to bees, butterflies and birds. It is one of the most popular everlasting flowers, due to its enduring beauty and a wide color palette. ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "Its bracts are yellow, orange, purple, pink and red.",
    "HardinessZones": "8-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Xerochrysum grows from 20 to 150 cm (8 inches to 5 ft) tall, depending on species.",
    "SoilNeeds": "Xerochrysum prefers soil with a pH of 5.5 to 7.5,, but the plant grows in nearly any well-drained soil.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Xerophyllum (Xerophyllum)",
    "Image": "/Flowers/Xerophyllum.jpg",
    "Desc": " Xerophyllum is a North American genus of  two species  of flowering plants (<span class=\"search\">Xerophyllum tenax and Xerophyllum asphodeloides) in the  family of Melanthiaceae . \n</span><span class=\"search\">These species have spiky leaves and small white flowers on long stalks. The flowers are slightly fragrant, held in a dense cluster atop a thick stem. They are unique looking and make a nice addition to perennial beds and containers.</span> ",
    "PlantType": "Herbs, Perennials",
    "Color": "Xerophyllum has unique cream-colored flowers.",
    "HardinessZones": "4-8",
    "BloomsIn": "Spring, Summer",
    "Height": "These plants can grow from 50 cm to 1,5 meters (2-5 ft) tall, with numerous small flowers growing on long flower stalks.",
    "SoilNeeds": "Xerophyllum prefers sandy or loamy soil that is well-drained.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Yucca (Yucca)",
    "Image": "/Flowers/Yucca.jpg",
    "Desc": " Yucca is a genus of  about 50 species  of evergreen perennials, shrubs and trees. It belongs to the  family of Asparagaceae  and is native to North America, Mexico and the Caribbean. \nThese versatile and easy-to-care plants come in a wide variety of sizes and shapes. They are known for their spiky sword-like leaves and beautiful bell-shaped flowers. The flowers are usually fragrant and white or cream in color. They are ideal for people who have little time or travel frequently because of their low maintenance requirements. ",
    "PlantType": "Cactus - Succulents, Shrubs, Trees",
    "Color": "The Yucca plant has green, sword-like leaves and white or whitish flowers.",
    "HardinessZones": "4-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "Yucca grows from 60 cm to 4,5 metres (2 to 15 ft) high, depending on species.",
    "SoilNeeds": "This plant grows best in sandy and well drained soil, with a pH level between 5.5 and 7.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "low",
    "Maintenance": "low"
  },
  {
    "Name": "Zantedeschia (Calla Lily; Arum Lily)",
    "Image": "/Flowers/Zantedeschia.jpg",
    "Desc": " Zantedeschia is a genus in the  family Araceae , native to southern Africa. The genus contains  8 species  and numerous cultivars of herbaceous perennials, divided into two main types: hardier outdoor forms with striking white flowers, called Arum Lilies, and the more tender forms with white-spotted leaves and colorful flowers, commonly known as Calla Lilies. Zantedeschia is widely popular and a beautiful addition to any garden. These plants can be grown in beds, borders, containers, but also in water (Zantedeschia aethiopica). ",
    "PlantType": "Bulbs, Perennials",
    "Color": "Zantedeschia is available in a multitude of colors including white, yellow, orange, pink, purple and even black.",
    "HardinessZones": "3-10",
    "BloomsIn": "Spring, Summer",
    "Height": "The plant grows between 30 and 90 cm (1 to 3 ft) tall.",
    "SoilNeeds": "Zantedeschia grows best in moist and well-drained soil. The ideal soil pH is between 6.0 and 6.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Zephyranthes (Rain Lily; Fairy Lily)",
    "Image": "/Flowers/Zephyranthes.jpg",
    "Desc": " Zephyranthes is a genus of  about 90 species  of flowering plants, mostly perennials, belonging to the  Amaryllidaceae family . They are native to southeastern United States, Central America and South America. \nThese plants have grass-like foliage and erect flower stalks that support a single flower consisting of six or eight petals. The flowers are funnel-shaped and more often appears in spring and summer. These beautiful flowers range from yellow through pink to white and can fit in any garden. Some species have sweet fragrance which spread happiness and joy. ",
    "PlantType": "Annuals, Bulbs, Perennials",
    "Color": "The flowers may be yellow, pink and white.",
    "HardinessZones": "7-11",
    "BloomsIn": "Spring, Autumn, Summer",
    "Height": "The plant can grow up to 30 cm (1 ft) in height.",
    "SoilNeeds": "Zephyranthes prefers well-drained soil with a good application of organic material.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  },
  {
    "Name": "Zinnia (Zinnia)",
    "Image": "/Flowers/Zinnia.jpg",
    "Desc": " Zinnia is a genus of the  family Asteraceae , containing  about 20 species  of annual and perennial plants, native primarily to North America with a few species in South America. The most popular species is “Zinnia elegans”, which is native to Mexico. \nThese easy to grow plants produce beautiful, large mixed blooms that come in an array of colors, hues, shapes and sizes. The plant is often cultivated in butterfly gardens because of its ability to attract butterflies and birds. ",
    "PlantType": "Annuals, Perennials, Shrubs",
    "Color": "These flowers are known for their vivid colors. They are often multi-colored and may be yellow, orange, white, red, pink and purple.",
    "HardinessZones": "2-11",
    "BloomsIn": "Autumn, Summer",
    "Height": "Zinnias range in size from dwarf species that only grow 17 cm (7 inches) high to vigorous types over 120 cm (4 ft) tall.",
    "SoilNeeds": "Zinnias prefer fertile and moist, but well-drained soil, with a pH level between 5.5 and 7.5.",
    "SunNeeds": "Full sun",
    "WaterNeeds": "avarage",
    "Maintenance": "low"
  },
  {
    "Name": "Zygopetalum (Zygo)",
    "Image": "/Flowers/Zygopetalum.jpg",
    "Desc": " Zygopetalum is a genus of  about 15 species  of flowering plants in the  family Orchidaceae , native to South America. \nThis plant produces waxy-looking, exotically patterned and colored blooms. The blooms are strongly scented and have greenish-brown petals and sepals, and purple color on their lips. These exotic orchids occur as both terrestrial and epiphytic, mainly in cooler high altitude regions. They are great indoor plants that will add interest and color to your home or office for many weeks. ",
    "PlantType": "Annuals, Perennials",
    "Color": "Zygopetalum has unusually colored flowers in shades of blue, purple, red and white.",
    "HardinessZones": "9-11",
    "BloomsIn": "Spring, Autumn, Winter",
    "Height": "Zygopetalum usually grows to a height of 40 cm (16 inches).",
    "SoilNeeds": "The plant prefers moist and well-drained soil, with a pH level between 5.5 and 6.5.",
    "SunNeeds": "Full sun, Partial sun",
    "WaterNeeds": "avarage",
    "Maintenance": "medium"
  }
]